["Sure! I’d like to receive a copy.\n", "Ingredients: \nFor the steak and the potatoes: \n\n1 1/2 lb (650g) flank steak, sliced against the grain\n1 1/2 lb (650g) baby yellow potatoes, quartered\n1 tablespoon olive oil\n3 tablespoons butter, divided\n5 garlic cloves, minced\n1 teaspoon fresh thyme, chopped\n1 teaspoon fresh rosemary, chopped\n1 teaspoon fresh oregano, chopped\nSalt and fresh cracked pepper\nCrushed red chili pepper flakes, optional\n\nThe marinade\n\n1/3 cup soy sauce\n1 tablespoon olive oil\n1 tablespoon hot sauce (we used Sriracha)\nFresh cracked pepper\n\nInstructions: \n\nIn a large bowl, combine the steak strips with soy sauce, olive oil, pepper, and hot sauce. Set aside to marinate while you cook potatoes.\nIn a large skillet over medium-high heat, mix 1 tablespoon olive oil and 1 tablespoon butter. When butter is melted, add potatoes. Cook for about 4 minutes, stir and cook an additional 4-5 minutes until potatoes are golden and fork tender. Transfer to a plate and set aside.\nKeep the same skillet over medium heat and add remaining 2 tablespoons butter, garlic, red chili pepper flakes, and fresh herbs. Lay the steak strips in one layer in the skillet, keeping the drained marinade for later. Cook on each side for 1 minute each, until nicely browned – adjust timing depending on how you like your steak.\nRight before the steak is done, you can stir in the reserved marinade if you like, and cook for one minute. Add the potatoes back to the pan and heat through. Adjust seasoning with salt and pepper if necessary.\nRemove from heat and serve immediately, garnished with more crushed chili pepper, fresh herbs, and a sprinkle of parmesan cheese over the potatoes if you like. Enjoy!\n\nFound on: Tips For Healthy Life\n", "Here is my recipe that is modified version of a couple online versions with extra added details that helped get it just correct. It is good enough for a brunch for two!\nIngredients:\n\n250g or heaver ribeye steak (if your steak is below this weight, skip the oven cooking part)\n2 eggs\nStore bought hash brown\n1 tomato cut in half or cherry tomatoes on the vine\n4-5 brown mushrooms, cleaned and destemmed\n0.5 tbsp. of Butter\n\nInstruction:\n\nStart by baking the hash brown according to the packaging (always go 5 mins longer to get them extra crispy)\nRub the steak with oil (something that can take high heat) and salt. Let it rest.\nWash and dry mushroom and tomato\n3-5 minutes before hash browns are ready, set the cast iron on high heat (don't put any oil as steak is coated in oil).\nOnce hash brown is taken out, lower the oven to 130c.\nPlace the tomato and mushrooms in the pan along with the steak. Sear both side of steak, one minute per side. Hit your vegetables with seasoning and olive oil.\nPlace in oven for 5-7 minutes (or until it reaches 60c for medium), take out pan and place it on medium heat on the stove. Remove the steak and let it rest .\nAdd butter to the place that you wanna put the eggs, and put the excess (if any) on top of the steak. Fit the hash browns on the side to heat up while cooking.\nCrack the eggs and season them. Take it of the heat before they are fully cooked.\n I like to cut the steak before returning it to the pan along with all the accumulated juices.\nServe with a slice of toasted bread (dark or sourdough bread recommended)\n\nEdit 1: I got the bulk of the recipe from this link. I love this guy for munchie recipes but he doesn’t write a detailed recipe and always misses out the details and cooking temperatures. So based on my experience and a couple of other online recipes, I wrote down everything that you need in order to get it correct.\nEdit 2: wow guys, thank you for all the kind words and awards. It has been a pleasure spending my evening with you.\nI hope I didn’t miss any questions.\n", "The original recipe with more images and instructions video can be found here\n \nPreparation Time: 25 minutes\nCooking Time: 1 hour\nServing: 70 pieces\nINGREDIENTS\n\n120g Rice Flour\n60g Corn Starch\n2 Eggs\n100g Caster Sugar\n200ml Coconut Milk\nA Pinch of Salt\nProper Amount of White Sesame\nProper Amount of Cooking Oil\n\nINSTRUCTIONS\n\nPrepare a larger container and crack in two eggs.\nAdd caster sugar, salt, and coconut milk and mix well.\nAdd the rice flour and corn starch, and stir until evenly mixed.\nStrain the batter, cover, and let it rest for 20 minutes.\nHeat the oil and put the mould in the pot. The amount of oil must cover the mould. Turn to medium heat when the oil is hot.\nAdd white sesame seeds to the batter and mix well.\nAfter the mould is hot, pick it up and shake off most of the oil.\nUse the kitchen paper to absorb off the excess oil.\nPut the mould into the batter and dip it to 9/10 of the mould.\nPut it in the oil and fry for about 5 to 10 seconds, shake it lightly for a few times to release the mould.\nFry until it is lightly colored and then you can turn it over. Fry until golden brown.\nPut the fried honeycomb cookies on the kitchen paper to absorb off the excess oil and let it cool.\nIt can be kept in a sealed container for 2 to 3 weeks.\n\n", "Deep in flavour lighter version of Japanese Beef Curry. Simple and delicious!\nIngredients for 4 portions:\n\n2 medium carrots, diced\n2 large waxy type potatoes (this type melts in the mouth)\n2 small onions finely chopped\n4 garlic cloves sliced\nhalf a celery stalk finely chopped\n500ml of beef stock\n200ml of coconut milk\n4tsp of curry powder (I used mild madras as it is one of my favourites)\n2tbsp of plain flour\n1tbsp of dark soy sauce\n1tsp of honey\n1tbsp of mirin\nrapeseed oil for frying\n\nInstructions:\n1. Heat 2tbsp of rapeseed oil in a frying pan.\n2. Sweat the onions and celery on medium heat for 5 minutes.\n3. Turn up the heat slightly and adds diced carrots and potatoes, fry until starts to brown (you may add little bit more oil at this step)\n4. Transfer to a medium pot and add beef stock, soy and mirin.\n5. Bring to boil and reduce to simmer, cook until soft (around 20 minutes)\n6. In the meantime prepare the curry roux, in the frying pan heat 3tbsp of oil and fry sliced garlic, when browned add 4tsp of curry powder and 2tbsp of plain flour. Cook on medium heat for around 2 minutes.\n7. When potatoes and carrots are cooked to desired texture add coconut milk and 1tsp of honey, bring to the boil and turn off the heat.\n8. Stir in curry roux to thicken and serve with rice and sliced green chilli.\nEnjoy!\nBlog post: https://www.insightflavour.com/post/japanese-potato-curry\n", "“mini” 😂\n", "Chicken\n- 4 tbsp canola oil\n- 4 boneless skinless chicken thighs \n- 3/4 cup panko\n- 1/4 cup grated Parmesan \n- 1 cup milk \n- 2 tbsp flour \nCajun sauce\n- 1 tbsp butter\n- Old bay\n- Paprika\n- Cayenne \n- 1 small yellow bell pepper diced \n- 1 small red bell pepper diced \n- 1 small red onion diced \n- 3 minced garlic cloves \n- 2-3 tsp chili flakes \n- 1 1/4 pints of heavy cream \n- 1 cup chicken broth \n- 1 box of farfalle pasta\nInstructions: \n\nMelt butter in large skillet over medium heat.\nAdd yellow and red bell peppers, and onion to same skillet,until crisp-tender, about 4 minutes\nAdd garlic and crushed red pepper to skillet and saute 3 minutes.\nAdd whipping cream and chicken stock.\nSimmer until sauce re-heats and thickens slightly, about 5 minutes\nAdd 1 cup grated Parmesan cheese to sauce, stirring to incorporate.\nSeason sauce to taste with salt and pepper. Reduce heat to low, simmer; sauce will reduce and \nPound chicken thighs until very thin (the thinner the better).\nMix panko breadcrumbs, flour, and Parmesan cheese together. Season with salt and pepper and Italian seasoning \nPlace milk in dish for dipping.\nDip chicken in breadcrumb mixture and then in milk and then back in breadcrumbs\nPlace in cast iron pan that the oil has been heated in and fry at medium high temperature until golden crisp and cooked through.\nAdd more oil as needed.\nRemove and drain chicken; keep warm.\nMeanwhile, cook farfalle pasta in large pot of boiling salted water until tender but still firm to bite.\nSave some pasta water. Drain remaining water and return to pot.\nAdd sauce and toss to coat, slowly adding reserved pasta water as needed \nPlace pasta with sauce on plate, and top with chicken thighs.\nServe, adding additional Parmesan and chili flakes to taste\n\n", "I messed up a bit at the heart shape there, a bit frustrated about it but don't mind too much because the end result was just too tasty. I like this more than tiramisu or cheesecake on their own.\nThe recipe in text form, originally written by /u/italian_cook (link to original post and video at the end of this comment)\nIngredients :\n\n500 gr mascarpone (1.1 pound)\n100 gr heavy cream ( 3.53 ounce )\n130 gr sugar ( 4.59 ounce )\n300 gr savoiardi (10.58 ounce )\n250 gr coffee (8.82 ounce )\nunsweetened cocoa powder\n250 gr cream cheese (8.82 ounce )\n10 gr  gelatin ( 0.35 ounce ) 1\n100 gr butter ( 3.53 ounce )\n6 EGGS\n\n----------- How to make a Savoiardi Crust ------------------\n\nTake  190 gr ( 6.7 ounce ) of savoiardi and put them in a plastic food bag  and crush to crumbs using a rolling pin. transfer the crumbs to a  bowl\ntake 100 gr (3.53 ounce) of butter, put it in a saucepan and melt it\nonce the butter is well melted put it in the savoiardi's crumbs, add 50 gr ( 1.76 ounce ) of coffee too and mix well\nPress  the mixture into the bottom of an 20 cm (8 inch) springform pan, you  can put a cake collar in it now. Chill in fridge until firm, normally 40  minutes.\n\n----------- How to Mascarpone  Cream  ---------------\n\nseparate the egg yolks from the egg whites\nput the gelatin in abundant water for at least 10 minutes until is soft\nin  a mixing bowl put the yolk and begin to work it with an electric whisk  if you are not sure of the freshness and quality of the eggs you can  always pasteurize the eggs ( see*)\nadd 1/2 of sugar at the time and let the yolks absorb it\nwork the yolks until they change color\nadd the mascarpone a little at the time beating with an electric whisk until it becomes smooth.\nRepeat the operation with the cream cheese\nput  the heavy cream in a saucepan, warm it on low heat and put the gelatin  well drained from the water. Mix until the gelatin is well melted in the  heavy cream\nAdd the heavy cream at the mixture a little at the time and continue to beat until the batter is creamy and smooth\n\n------------ Assembly-------------------------\n\nCut the remaining savoiardi in half\ntake the springform pan from the fridge and pour half of the cream cheese mixture\nSoak  the savoiardi in the cold coffee for a few moments and distributed it  on the cream pressing gently until you obtain a layer  pour another  quarter of the cream.\ncan  happen that the savoiardi will rise a little, don't panic. Put the cake  in the fridge  for 20 minutes then press a little the savoiardi in the  cream.\nFinally cover with the remaining cream cheese mixture  put the springform pan in fridge for at least 3 hour.\ntake off the cake collar and using a strainer dust the cheesecake with a dense layer of unsweetened cocoa powder.\n\nThat's  all!  if you have any question feel free to ask.  See you next time, i  think that will be a classic carbonara!  In the meanwhile Buon  Appetito!!!\n*To pasteurize egg  yolks. Whip them with 65 gr sugar while you prepare the syrup with  another 65 gr sugar and 45 gr of water. Wait for the syrup to reach 120°  C. ( 248°F), then pour it very slowly over the whipped yolks, mixing  the syrup well with the yolks if you have a stand mixer and a food  thermometer the operation it's pretty easy\n​\nThe original source: https://www.reddit.com/r/recipes/comments/ja0f02/no_bake_tiramisu_cheesecake_a_sweet_fusion/\n", "You can also check out the video to see full instructions: https://youtu.be/tCBUV7Ub3pQ\nIf you don't like FISHY TASTE, feel free to adjust the amount of dried seafood ingredients. Thanks for all your feedback. \nIngredients\nFor the broth\n• 1 whole stewing chicken or 3 lbs chicken bones\n• 1 piece kombu\n• 1/4 cup dried scallops (optional if it's too fishy for you)\n• 1/4 cup anchovies (adjust the amount to your taste)\n• 1/4 cup bonito flakes\n• 1/4 cup dried shrimps (adjust the amount to your taste)\n• 1/2 inch ginger thinly sliced\nFor the tare\n• 1 cup soy sauce\n• 1 piece kombu\n• 1/2 cup mirin\n• 1/2 cup sake\n• 8 scallions\n• 1/2 cup bonito flakes\n• 1/4 cup sugar\n• 1/2 inch ginger thinly sliced\n8 gloves garlic crushed\nInstructions\n\nPut all the ingredients for the broth In a pressure cooker. Add about 3 quarts of water. Select the \"soup\" setting, and set the timer for 90 minutes.\nStrain the broth through a colander or fine-mesh sieve. Skim the fatty oil off the top of the broth. Set aside.\nPlace all the ingredients for the tare in a medium saucepan over high heat. Bring it to a boil and then reduce heat to low, and simmer for 10 minutes. Strain the mixture through a fine-mesh sieve into a bowl.\nIn a large bowl, add 2 tablespoons of tare. Ladle about 2 cups of the broth. Place the cooked ramen noodles. Taste to see if the broth needs more tare.\nAdd any toppings that you like, such as chashu (see my recipe linked above), menma, corn, toasted seaweed or soft boiled egg. Garnish with green onions.\n\n", "Ingredients Spätzle Dough\n\n1/4 cup (50 ml) Water ( might have to add more)\n2 Cup (250g) Flour\n3 Eggs\n1tsp (5g) Salt\n\nIngredients Fried Onions\n\n1-2 Cups Vegetable Oil\n1/2 Onion\n\nIngredients Cheese Spaetzle\n\n12-14 Oz (340- 400 g) Strong flavored Cheese (le Gruyere, Strong Cheddar,...)\n4 Slices of Bacon\n1/2 Onion\n1/4-1/2Cup  Heavy Cream\n\nBroil for 5 minutes\nDirections Spaetzle\n\nMix all dry ingredient together\nAdd liquid ingredients\nKnead the dough for around 10-12 minutes, with a wooden spoon until the dough gets smooth and you can see some big bubbles.\nlet the dough rest in a bowl covered with some plastic wrap for at least 30 min.\nBoil one big pot of salt water\nUse your spaetzle tool and form the spaetzle. Pusher for short round Spaetzle, Board for long and thin Spaetzle -> check out the tutorial clip linked at the bottom\nBoil it for 3-5 minutes, drain them and put them aside\n\nDirections Fried Onions\n\nCut the onion into small slices, I recommend using a mandolin\nBoil the onions in salted water for 5 minutes\nDrain and dry them afterwards\nFry the Onions in Vegetable oil for 5 minutes or until they are lightly brown.\nPut them on paper twol and let the access fat drip off.\n\nDirections Cheese Spaetzle\n\nCut the Bacon slices into small stripes and roast them for a few minutes before you add the 1/2 diced onion to the pan ( I recommend using a cast iron pan)\nAfter the Onions are soft and the bacon is almost crispy you are going to add some butter and the spaetzle. Saute it for a few minutes until the access water is gone.\nSlowly add the Cheese in several batches. As oosn as the first batch is melted add the heavy cream to the speatzle. As soon as it is incorporated nicely add the left over cheese.\nStir frequently until everything i smelted and nicely combined.\nDepending on the cheese you used, you might have to season the Spaetzle as well ( salt, Peper, Nutmeg...) whatever you like\nPut the pan into the broiler for 5 minutes until golden brown\nTopp it off with the crispy onions\n\nEnjoy your homemade Spaetzle\nVideo tutorial for the Spaetzle making process: Spaetzle Making Tutorial\n", "Mushroom Risotto with Parmigiano Reggiano and Fresh Italian Parsley\nFor full recipe and lots of tips & tricks, visit: https://maplewoodroad.com/food/what-is-risotto-mushroom-risotto/\nINGREDIENTS\nRisotto\n\n1 c Arborio rice\n2 Tbsp butter, divided\n1 Tbsp extra-virgin olive oil\n1/2 c dry white wine\n4 c beef stock, warmed up (I use Knorr bouillon cubes)\n1/2 c freshly grated Parmigiano Reggiano\n1/4 tsp freshly cracked black pepper\nKosher salt, as needed\n\nMushrooms\n\n8 oz baby portobello (aka baby bellas, cremini, etc), thinly sliced to 1/4\"\n1 Tbsp butter\n1 to 2 Tbsp extra-virgin olive oil\n1/4 c shallots or yellow onion, chopped\n1 Tbsp minced garlic\n1 Tbsp soy sauce\n1 tsp thyme and/or sage\n1/2 tsp kosher salt\n1/4 tsp freshly cracked black pepper\n1/2 c roughly chopped flat leaf Italian parsley\n\nINSTRUCTIONS\nBasic Risotto\n\nHeat 1 Tbsp butter and 1 Tbsp extra-virgin olive oil in a saucepan until you hear a light sizzle and the butter begins to bubble.\nAdd 1 c of Arborio rice and stir evenly and thoroughly.\nAfter a minute or so – when the rice gets glossy (not brown), add 1/2 c of dry white wine and keep stirring. \nOnce the wine starts to bubble, it will be absorbed quickly (within about 2 minutes), so make sure you have 4 c of beef stock warmed and ready. Add one ladle of stock at a time and stir. Adjust the heat so it’s barely boiling. Just a couple bubbles here and there.\nOnce the liquid is absorbed, add another ladle of stock, stir, and repeat. Watch, smell, and taste. From adding the first ladle to the last, it takes about 25 minutes from start to finish. Taste, but be careful with adding salt too soon. The stock will add additional salt, and so will the salty Parmigiano Reggiano. \nWhen the rice is done, add (at least) 1 Tbsp butter and (at least) 1/2 c of Parmigiano Reggiano (the good stuff). Stir for about 2 minutes and add a couple cranks of black pepper (1/4 tsp).\n\nMushroom Risotto\n\nHeat 1 Tbsp butter and 1 Tbsp extra-virgin olive oil in a saucepan over medium heat. \nAdd 1/4 c chopped shallots and cook for 2 minutes until translucent.\nAdd 8 oz sliced mushrooms, 1 Tbsp minced garlic, 1 tsp dry thyme and/or sage, 1 Tbsp soy sauce, and season with 1/2 tsp kosher salt and 1/4 tsp freshly cracked black pepper. Stir occasionally and cook (simmer) for about 8 minutes. \nOnce the mushrooms have absorbed all the liquids, taste them and add more salt if necessary. Remove from the saucepan and set aside. \nNext, cook the risotto as outlined in the Basic Risotto recipe above.\nOnce the risotto is ready in its creamy deliciousness, put the cooked mushrooms back in the risotto and stir it all together.\nSprinkle with some roughly chopped fresh flat-leaf Italian parsley and pour yourself a glass of Sauvignon Blanc. You deserve it. \n\n", "Link to recipe: http://cookingfornoobs.co/?p=724\nHave fun and make your own bread!!\nINGREDIENTS:\n\n1.75 ounces warm water\n1 tablespoon dry yeast\n16 ounces flour (500 g)\n2 teaspoons salt\n10 ounces cool water (we might need less water)\nGrain poppy, sesame seeds, flex seeds or additional flour for decorating.\n\nINSTRUCTIONS\nPlace warm water in a small bowl and add the yeast, mix then set aside.Put the flour in a large bowl, add the salt and stir. Make a hole in the center, add the yeast mixture and stir.\nAdd the cool water, little at a time, while stirring by hands or using a spoon. The dough must be shaggy and sticky (you may not use all of the water, depending on how absorbing the flour is.)\nCover the bowl with plastic wrap and set aside for 30 minutes rest.\nAdd some flour in your kitchen surface to work the dough, use your hands to press it and to make sure you are releasing all the air bubbles from it. it should take around 5 minutes to work your dough well. if the dough is still sticky (Because you used more water than supposed to, add some flour until the dough is not sticky anymore.)\nPlace the dough in a bowl, and cover again with plastic wrap, set aside and let it rest for 1h30 at least.\nDivide the dough into 4, and shape each portion into a long loaf (each one should be 12 inches long and 1.5 inches in diameter), place them on a floured towel, and cover them with another towel or an oiled plastic wrap. Allow 30 minutes to rise.\nPreheat the oven to 450 degrees, and place a pan of water on the bottom rack.\nTransfer the baguettes on top of a baking sheet, and sprinkle each one with the seeds to decorate, make 4 slashes in each loaf using a sharp knife then place in the oven to bake for 35 to 40 minutes. To make sure your baguette is well cooked, it should make a hollow sound when tapped.\nServe with anything you want or slice them to make bruschettas. If you are not going to use all of them in the same day or the day after.Freeze them until further use.\nEdit: 12 inches long instead of 15, sorry I am not used to inches, just moved to Canada, and trying to adapt :)  \nEdit 2: the recipe is originally from here: https://bakingamoment.com/crusty-french-baguette-recipe/ I made some changes, and here is my result.\n", "ingredients：\nall purpose flour 400g\nsugar 12g 1 tablespoon\nsalt 1g 1/8 teaspoon\nboiling water 83g 1/3 cup\nwarm milk (about 35 °C) 167g 2/3 cup (reduce the milk amount by 15-30g, if you live in a humid place)\nyeast 3g 1 teaspoon\nlarge eggs 2\noil 24g\nfor egg wash:\n1 egg\n1 tablespoon milk\n1/2 teaspoon confectioners sugar\nsmall pinch salt\nMethod:\n\nStart by combining flour, sugar and salt together. Mix with a spatula. Add boiling water and slowly incorporate\nnow microwave some cold milk for 30 seconds. add yeast and mix. pour into the flour and water mixture. add eggs and mix. the dough should be very sticky. DO NOT add more flour. Rest for 20 mins with a lid on\nafter you have rested add oil. Oil should make the dough no sticky. Knead the dough until the oil in incorporated and it is sticky again. Cover and rest for 1 hour.\nafter one hour, punch the dough with floured hands until you have let most of the air out. It should be about the size of the dough before resting. Now, split into three pieces. flour a surface and roll it out. fold both ways in. then, smooth side down, roll it out with a pin. With your hands, roll it into a roll ( sorry, is this confusing?) and place into a prepared bread tin. This is optional. If you want to just place all the pieces into the bread tin. but doing that will help the bread have more layers and fluffiness. rest in bread tin for 1 hour.\nnow, make your egg wash by combing all ingredients and mixi with a whisk. using a brush bush a thin layer on. cook at 190C for 30 mins. take out and cool for 5 mins.. You can split them open with your hands or cut with a knife. Enjoy!!!\n\n", "Excited to share a dish I grew up with! \nThe salmon is a super easy weeknight recipe that’s ready in under 25 minutes, and the sauce is something my parents always have a stash of in their fridge, since it pairs well with a ton of different dishes.\nHere's the video for a walkthrough.\nSourcing Salmon Sustainably\nFor this specific recipe, my parents bought Atlantic salmon. With regards to Atlantic vs Pacific, farmed or wild-caught, there’s no right or wrong choice, but my parents have a slight preference for Atlantic salmon, which nowadays are primarily farmed. \nAs one of the world’s most consumed species of fish, salmon is a massive industry, with several million tons sold every single year, and tons of complexity surrounding how we source it in a sustainable, environmentally friendly way. \nAs consumers, an easy way to do our part is by making sure we vote with our wallets. Monterey Bay Aquarium in California runs a free website and mobile app called \"Seafood Watch\" which has a ton of recommendations on how to choose and purchase seafood in ways that have the least environmental impact.\nSalmon + Chinese communities in the west\nAs I was researching this recipe, I felt like it was important to share how salmon and fishing helped form some of the first Chinese communities in the West.\nDuring the Gold Rush, tens of thousands of Chinese immigrants, mostly from Guangzhou, flocked to California enticed by the promise of the Gām Sāan, or gold mountain in Cantonese, although many were forced out of mining work due to discrimination. \nUndeterred, a group of experienced fishermen found their own gold in abalone and other fish along the Monterey coast. Known as China Point by locals, Chinese immigrants proudly sparked the first large scale commercial fishing industry in California, supplying fish and shellfish to countries all over the world. \nDuring and after the Gold Rush and the construction of the Transcontinental Railroad, many Chinese immigrants relocated to Seattle, Vancouver, and surrounding areas to work for salmon canneries and on fishing boats, doing the difficult work of supplying and processing most of the world’s salmon at the time.\nToday, the once thriving Chinese enclave in Monterey no longer exists, but in spite of periods of intense discrimination and oppression, Seattle and Vancouver are still homes to some of the largest Chinese communities abroad.\nTHE RECIPE\nOverview\n\nPrep Time: 10 min\nTotal Time: 25 min\nYield: 4 servings\n\nIngredients for Salmon\n\n1.5 lb salmon\n1 egg\nwhite pepper (to taste)\n3 tbsp cornstarch\n2 tbsp corn oil\n0.50 tbsp rice cooking wine\ngarlic salt (to taste)\n\nDipping Sauce\n\n1 tbsp sugar\n0.50 tbsp vinegar\n2 tbsp light soy sauce\n0.25 tsp chili sauce (to taste)\n2 tbsp boiling water (very important)\n\nOptional Garnish\n\ncilantro\nbroccoli\n\nStep 1 - Cut salmon\nThis is totally optional, but if you're planning on garnishing the salmon with anything (like cilantro) or serving it with any vegetables (like broccoli), then it's best to cut it before the salmon (for sanitation).\nTo make our salmon (1.5 lb) fillets, make diagonal cuts about 2 cm apart. The diagonal cuts help increase the surface area of the fillets, which leads to a faster cook and less moisture loss.\nStep 2 - Coat salmon\nSpread the fillets out on the cutting board, and sprinkle white pepper on each side. The white pepper helps counter some of the \"fishy\" taste of the salmon, which has a slightly negative connotation in Chinese cuisine.\nWe'll crack and mix our egg(s) (1) into a bowl, and spread out cornstarch (3 tbsp) on a plate.\nCoat each side of each salmon fillet first in the egg, and then the cornstarch. Make sure each side is evenly coated.\nThis coating helps the salmon retain its juices, and also add some delicious crunchy/crispiness when it's cooked.\nStep 3 - Cook salmon\nHeating the wok\nWe’ll set our stove to medium high and let our wok heat up.\nUnlike other Chinese recipes, with salmon, it’s important that the wok gets hot enough but not too hot. It’s difficult to give an exact amount of time, since it depends a lot on your stove and cookware.\nMy dad relies on his own intuition that he’s developed over 50 years of cooking. For the rest of us, he waited about 2-3 minutes on this current setup.\nCook the salmonThen, we’ll add corn oil (2 tbsp), and swirl it around the wok.\nThe wok and the oil should be hot enough once the oil starts shimmering, or making ripples.\nOnce this happens, we’ll add our salmon to the wok.\nMy dad had just enough room for 8 fillets, so try not to overcrowd your wok and consider cooking in multiple batches if necessary.\nThe total cooking time for the salmon also varies depending on how hot your stove is, how thick each fillet is, and what type of pan or wok you’re using.\nOn my dad’s current setup, which has less heat output than a gas stove, he cooked each fillet for 3 to 4 minutes on each side, generally not flipping the salmon over more than once.\nFor a visual cue, once the salmon fillet starts to turn more white / yellow-ish, you can flip it.\nYou should be able to tell if the salmon is done if it easily flakes. If you wanted to get more precise, you can also insert an instant-read food thermometer into the thickest part of the salmon.\nOther tips\nAs long as it’s cooked enough, the rest is just a lot of trial and error to find the texture of salmon that’s perfect for you. My dad tends to prefer salmon that’s more medium or well-done, so if you prefer something more rare, then adjust accordingly.\nKenji from the Food Lab has a great blog post and video with a bunch of helpful tips on how to pan fry salmon. Not all of these tips apply to this specific recipe, but it’s still a great resource, and I’ve linked to it in our description.\nStep 4 - Add flavors, cover wok\nAdd garlic salt to the fillets.\nThen, we'll add rice cooking wine (0.50 tbsp). We should have the lid for the wok within reach, because we’ll be covering the wok immediately after we pour the cooking wine in. We’ll only be covering the wok for about 20 to 30 seconds before we take the lid off.\nStep 5 - Uncover, plate, garnish\nUncover the wok, and turn the heat off. Transfer the salmon fillets to a plate, and add any garnish you'd like.\nStep 6 - Create sauce\nTo make the sauce, mix together sugar (1 tbsp), vinegar (0.50 tbsp), light soy sauce (2 tbsp), boiling water (2 tbsp), and chili sauce (0.25 tsp). Mix it all together for about 5-10 seconds.Notes:\n\nIf you prefer more spiciness, feel free to add more chili sauce.\nIf you’re wondering why my dad specifically uses boiling water, it’s to help extend the shelf life of the sauce. My parents elaborate on why during our \"Meal Time\".\n\n-------\nOur why\nI've always wanted to honor my parents and capture the hundreds of recipes that my dad's perfected over 50 years as a Chinese chef. I want to celebrate their legacy and epic journey of making something of themselves here in America, and pass it down to our kids.\nThanks for reading! Hope you all love the recipe :)\n", "Shortbread Crust:\n100g or 1/2 cup Unsalted Butter, soft.\n50g or 1/2 cup Sugar\n150g or 1 cup + 2 tbsp All Purpose/Plain Flour\nCaramel Filling:\n200g or 2/3 cup Condensed Milk\n150g or 2/3 cup Unsalted Butter\n50g or 1/2 cup Sugar\n50g or 3 tbsp Golden Syrup, can also use Honey or Maple Syrup\nChocolate Topping:\n200g or 1 cup Chocolate Chips/Squares\nPrep:\n\nPreheat oven to 350F/175C. Line an 8-inch square pan with parchment paper and grease the sides with butter.\nIn a bowl, beat sugar and butter to form a smooth paste. Add flour and gently mix it all together. Use your hands to knead and mop up all the crumbs.\nFlatten crust inside pan and try to level it as much as you can. Bake for 20-25 minutes or until your crust is a light golden brown around the edges. Let it cool in the pan.\nWhile your crust is baking, start the caramel. Put all filling ingredients into a saucepan and place on medium-high heat, stirring gently. Watch it closely as you stir. If you see little brown slivers at the bottom of the pan, stir them in vigorously and turn the heat down to a low-medium. Simmer it gently until it reaches a deep, golden brown color. It should take around 15 minutes.  \nWhen ready, pour the caramel over the cooled biscuit crust and spread evenly using an offset spatula or knife. Let this cool for at least an hour. You don’t want the caramel to be warm or it’ll ruin your chocolate. Don’t cool in the fridge or else you’ll end up with a hard mess. \nMelt chocolate using microwave or double boiler and pour over cooled caramel to finish off.\nTo serve, heat up a knife using hot water (make sure you dry it) or a blowtorch. This will ensure you get a nice clean cut. Cut into whatever size slices you want; I usually go for 1-inch squares.\n\nIf you want to watch the video of it being made, feel free to check it out here:\nhttps://www.thesulkychef.com/home/millionaires-shortbread\n", "They made this cake on the most reason season of the British baking show! I had never seen it before then,  not sure how common it was. Looks beautiful.\n", "Is homemade pasta worth it?  I’ve been thinking about making my own but I’m not really a pasta guy.\n", "That honestly looks so good, great job.\n", "This almost looks like a digital render it’s so perfect\n", "I'm gonna thank the next person to gild me with my world-famous peanut butter sandwich recipe.\n", "When I lived in Korea, there was a place that did rice “burgers” right near my apartment. It was awesome! I love the use of the waffle maker to crisp up the rice!\n", "Link to the recipe with more info and images: Little fluffy dinner rolls\nTotal ingredients needed\n\n640 g All-purpose flour\n15 g Salt\n35 g White sugar\n30 g Yeast – Fresh\n350 g Milk – 3,5% fat\n60 g Butter\n2x Eggs (medium)\n-----------\nYou will have dough of about 1.230 g in total suitable for 20 little dinner rolls.\n\n1. Mix\n\n640 g All-purpose flour\n15 g Salt\n35 g White sugar\n30 g Yeast – Fresh\n350 g Milk – 3,5% fat\n60 g Butter\n2x Eggs (medium)\n-----------\nSwitch to dough hooks\nMix all of the mentioned ingredients except the butter together in a stand mixer for 3 minutes on speed level one and 5 minutes on speed level two\nAdd the butter after 3 minutes of mixing and mix further for another 5 minutes on speed level two\nThe dough should be slightly sticky and soft\n\n2. Bulk fermentation\n\nTransfer the dough to a lightly greased bowl\nCover the dough and let it rest for a total of 90 minutes at 20-22°C (68-71,6°F)\n\n3. Shape\n\nLighltly grease a baking plate with butter and set aside\nPunch down the dough to degase it a bit\nDivide the dough into 20 small dough balls equalling each one to about 61 g\nOn a very lightly floured surface flatten the dough ball a bit\nPull the edges from the sides in the air and then in the middle of the dough to create a smooth outer skin on all sides of the dough ball\nFlip the dough upside down\nCover the dough with your hand forming a claw around it\nStart rotating little circles with your hand on the dough for about 10 to 15 seconds\nAgain flatten the dough a bit\nPlace it seam-side down on the baking plate next to each other, but not touching the other dough balls\nThere should be 4 rows of 5 dough balls per row\n\n4. Proof\n\nCover the dinner rolls with a towel\nLet them proof for 1 hour at 20-22°C (68-71,6°F)\n\n5. Bake\n\nPreheat oven to 190°C (374°F) with the upper and lower heat function\nPut the dinner rolls in the oven and bake for 15 to 20 minutes or until golden brown\nAfter baking take your huge bread rolls out immediately\n\n6. Coat\n\nWhile the dinner rolls are still on the baking plate, brush them with 15 g of melted butter\n\n7. Cool\n\nLet your little fluffy dinner rolls cool for 15 minutes and enjoy while still warm\n\n", "Instructions\nHeat a deep, large skillet or sauté pan on medium. Slowly warm olive oil in the pan. Add chopped onion, sauté for a few minutes until the onion begins to soften. Add garlic and continue to sauté till mixture is fragrant.   \nAdd the diced bell pepper, sauté for 5-7 minutes over medium until softened.\nAdd tomatoes and tomato paste to pan, stir until blended. Add spices and sugar, stir, and allow mixture to simmer over medium heat for 5-7 minutes until it starts to reduce. \nAt this point, you can taste the mixture and spice it according to your preferences. Add salt and pepper to taste, more sugar for a sweeter sauce, or more cayenne pepper for a spicier shakshuka (be careful with the cayenne... it is extremely spicy!).\nCrack the eggs, one at a time, directly over the tomato mixture, making sure to space them evenly over the sauce. I usually place 5 eggs around the outer edge and 1 in the center. The eggs will cook \"over easy\" style on top of the tomato sauce.\nCover the pan. Allow mixture to simmer for 10-15 minutes, or until the eggs are cooked and the sauce has slightly reduced. Keep an eye on the skillet to make sure that the sauce doesn't reduce too much, which can lead to burning.\nSome people prefer their shakshuka eggs more runny. If this is your preference, let the sauce reduce for a few minutes before cracking the eggs on top-- then, cover the pan and cook the eggs to taste. Garnish with the chopped parsley, if desired.\nShakshuka can be eaten for breakfast, lunch, or dinner. For breakfast, serve with warm crusty bread or pita that can be dipped into the sauce (if you are gluten-intolerant or celebrating Passover, skip the bread). For dinner, serve with a green side salad for a light, easy meal.\n( A good thing to do if pepper give you stomach pain and it works for me everytime it's to roast them in the oven for 25 min then place them in a bowl cover with cling film for 10 min ! They will sweat and you will be able to peel the skin off so easily ! Trust me this will peel just like a banana haha ! Then it's easier to digest this beauty ! Hope this help have a good day everyone )\n", "Chicken and Dumplings from Scratch\nFor full recipe, tips, & tricks, visit: https://maplewoodroad.com/food/easy-homemade-chicken-and-dumplings-from-scratch/\nINGREDIENTS\n\n2-1/2 lbs boneless, skinless chicken breast\n2 Tbsp vegetable oil\n1/2 medium onion, chopped\n1-1/2 stalks celery, chopped\n3 medium carrots, peeled and chopped\n1-1/2 c peas\n2 cloves garlic, minced\n4 c chicken broth\n1/3 c heavy cream\n6 Tbsp salted butter, melted\n1 tsp thyme\n2 bay leaves\n1/2 c parsley, roughly chopped\n1/2 c all-purpose flour\nSalt and pepper to taste\n\nDumplings (makes 10)\n\n1 c all-purpose flour\n1/2 tsp baking powder\n3/4 c heavy cream\n1 Tbsp unsalted butter, melted\nPinch of salt\n\nINSTRUCTIONS\n\nAdd 2 Tbsp of vegetable oil to a saute pan over low-medium heat. \nWhen the oil begins to sizzle, add the chicken breasts and brown on each side, for a total of about 10 minutes. Then, remove the chicken and set aside.\nIn the same pan, saute onion, celery, and carrots for about 5 minutes, until they begin to soften. \nAdd garlic and saute for 30 seconds.\nAt this point, add butter and flour to the pan, whisk it together quickly, and then add the stock. \nAdd the bay leaves, thyme, parsley, peas, and cream. Add the chicken back to the pan. Simmer for 30 minutes. Taste the sauce and add salt and pepper as needed.\nAfter 30 minutes, remove the chicken and using two forks, shred the chicken into bite-size pieces. Add the shredded chicken back to the pan.\n\nDumplings\n\nIn a bowl, mix together the dry ingredients (flour, baking powder, and salt).\nNext, add in the heavy cream and melted butter.\nMix everything together with a fork until it becomes a slightly sticky dough. \nKnead the dough with your hands for about one minute.\nUsing a tablespoon, scoop out balls of dough and form them into small meatball-sized balls.\nDrop the dumplings into the thick sauce in the pan, making sure they’re not touching each other, as they'll puff up a bit while cooking.\nCook for an additional 30 minutes.\nServe in a deep pasta bowl, garnished with some fresh parsley and thyme. Enjoy!\n\n", "[deleted]\n", "The original recipe with more details and images can be found here.\nTotal ingredients needed\n\n300 g All-purpose flour\n250 g White sugar\n350 g Butter\n4x Eggs\n10 g Baking powder\n30 g Cocoa powder – Unsweetened\n2 packages (~16 g) Vanilla sugar\n500 g Farmer’s cheese (40% fat)\n1 package (~37 g) Instant vanilla pudding mix\n1x Vanilla bean\n\n1. Mix chocolate dough\n\n300 g All-purpose flour\n30 g Cocoa powder – Unsweetened\n10 g Baking powder\n125 g White sugar\n1 package (~8 g) Vanilla sugar\n150 g Butter (softened)\n1x Eggs\nStart by sifting in the all-purpose flour, cocoa powder and baking powder\nMix with a hand mixer using dough hooks\nAdd white sugar, vanilla sugar, softened butter and egg and mix until well combined\n\n2. Rest\n\nForm a ball out of the chocolate dough Wrap it in cling film Place in the fridge for 30 minutes\n\n3. Melt butter\n\nPlace 250 g butter in a pot and bring it to low / medium heat\nStir while cooking\nAfter whe whole butter is melted put it aside to cool down\n\n4. Coat springform pan\n\nGrease a 26 cm springform pan with butter on bottom and all sides\nTake the chocolate dough out of the fridge and divide in half\nPut one half aside and use the first one for coating the springform pan\nPress the previously created dough into the bottom and up the sides of the springform pan tightly\n\n5. Mix filling\n\n3x Eggs\n125 g White sugar\n1 package (~8 g) Vanilla sugar\nPreviously melted butter\n500 g Farmer’s cheese (40% fat)\n1 package (~37 g) Instant vanilla pudding mix\n1x Vanilla bean\nMix all of the mentioned ingredients together with the hand mixer on low speed\nStart by adding the vanilla sugar and eggs\nAfterwards add the previously melted butter, farmer’s cheese, instant vanilla pudding\nScrape the insides of the vanilla bean and also add them to the mixture\nYou want to have a homogenous mass so don’t mix too long\nAs the last step, pour the whole mixture into the coated springform pan\n\n6. Scatter chocolate dough\n\nTake the other half of the chocolate dough you previously have put aside\nScatter it around the top of the filling\n\n7. Bake\n\nPut a bowl with about 500 g water on the bottom of the oven and a baking grill in the middle\nPreheat it to 165°C (329°F) with the upper and lower heat function\nAdd the chocolate cheesecake and bake for 60 minutes\nAfter 60 minutes of baking turn the oven off and slightlty open the oven door\n\n8. Cool\n\nFor a good result you want to cool down the chocolate cheesecake very slowly\nAs mentioned before start the cooling down process by slightly opening the oven door for 60 minutes\nAfterwards place the cake on the counter for further cooling of 3 hours\nAs the last step, put it in the fridge and let it chill for at least 4 hours\n\n", "Just 1 egg white, and equal weight sugar, flour, & butter makes a whole sheet pan of these. They're great solutions for dealing with extra egg whites. Sandwich them with some melted chocolate, and you got copycat Milano cookies!\nStep-by-Step Video for following along\nIngredients (makes about 16-20 pieces):  \n\n1 egg white (~30g)   \n30g sugar (2 tbsp)\n30g butter, melted (2tbsp)\n15g flour  (2 tbsp)\n15g ground almond (2tbsp)\n1/2 tsp vanilla paste or extract \n\nInstruction: \n\nMix together all ingredients until thoroughly combined. \nPipe the batter out to any shape you like.\nBake at 375F for 9~10 minutes, until edges are browned. \nOptional shaping: The cookies can be bend while hot. You can press them on a rolling pin and let them cool; they will harden as they cool. \n\n", "Crab Imperial, Chef Frank shows you how to make this old school Maryland classic.\nvideo tutorial\nINGREDIENTS....makes 3 servings\n1lb. Blue crabmeat\n1 1/2 cups mayo\n1 tsp celery salt\n2 tbsp fresh lemon juice\n1 1/2  Dijon mustard\n1 tbsp Worcestershire sauce\n1/2 tsp black pepper\n2 tbsp minced fresh parsley\n​\nRecipe 1. Drain crabmeat but gently squeezing out all excess liquid.\n\nIn large bowl combine mayo, lemon juice, celery salt, mustard, Worcestershire sauce, black pepper.\nPlace crabmeat and parsley in a separate large bowl.\nStart by adding 2/3 cup imperial mix to crab and parsley. Add enough imperial mix to coat the crabmeat. This mixture should be wet but not soupy.\nPut crab imperial in casserole dish. DO NOT pack tightly.\nCover your crab imperial with moderate layer of the remaining imperial sauce. 7. Sprinkle with paprika. 8. Bake at 400 for 12 minutes or until golden brown.\n\n", "Just followed the recipe from Cafe Delites: https://cafedelites.com/creamy-tuscan-chicken/\nSuper easy and can be done with many sides. I personally made some buttery mashed potatoes.\nI used:\n4 chicken breasts\nsalt&pepper to taste\n1 1/2 tsp paprika\n3 tbs oil from the sun-dried tomatoes jar\nFor the sauce:\n6 cloves minced garlic\njar of sun-dried tomatoes \n1 tsp dijon mustard\n1 cup double cream \n3 cups spinach\n1/2 cup grated parmesan\nsome parsley to top with\n(i didn’t use onion powder even though it’s mentioned in the recipe)\n\nSeason the chicken with the salt, pepper and paprika and then sear on the pan until golden and cooked-through. Set aside.\nIn the same pan, heat up the rest of the oil and fry the garlic for 1-2 minutes. Add the tomatoes and cook for 3-4 minutes. Add the mustard and mix it in.\nReduce heat and add in the cream, cook to a gentle simmer. Add some more salt and pepper.\nAdd the spinach and cook until the leaves are wilt in the sauce. Then add the parmesan. Cook for another 2 minutes.\nAdd the chicken, top up with parsley and serve :)\n\n", "I was inspired by vineyardbaker on Instagram and decided to try focaccia bread art for Easter. I used the recipe from this site for the focaccia.\n>Ingredients\n>1/2 cup (120 ml) extra-virgin olive oil\n>2 garlic cloves, finely minced [I used 5, but my husband and I are garlic fiends]\n>1 tablespoon chopped fresh thyme or 1 teaspoon dried\n>1 tablespoon chopped fresh rosemary or 1 teaspoon dried\n>1/4 teaspoon fresh ground black pepper\n>1 cup (235 ml) warm water\n>2 1/4 teaspoons active dry yeast (1 packet)\n>1/4 teaspoon honey\n>2 1/2 cups (315 grams) all-purpose flour\n>1/2 teaspoon fine sea salt\nDirections\nIn a cold medium skillet, combine olive oil, minced garlic, thyme, rosemary, and the black pepper. Place the pan over low heat and cook, stirring occasionally, 5 to 10 minutes or until aromatic, but before the garlic browns. Set aside.\nIn a large bowl, combine the warm water, yeast, and honey. Stir a few times then let sit for 5 minutes.\nAdd 1 cup of the flour and a 1/4 cup of the infused garlic-olive oil mixture to the bowl with yeast and honey. Stir 3 to 4 times until the flour has moistened. Let sit for another 5 minutes.\nStir in the remaining 1 1/2 cups of flour and the salt. When the dough comes together, transfer to a floured board and knead 10 to 15 times until smooth.\nTransfer the dough to a large oiled bowl, cover with a warm, damp towel and let rise for 1 hour. (It’s best to let the dough rise in a warmer area of your kitchen).\nAfter 1 hour, heat the oven to 450 degrees Fahrenheit.\nUse two tablespoons of the remaining garlic-olive oil mixture to oil a 9-inch by 13-inch rimmed baking sheet. (See above if you do not have this pan size).\nTransfer the dough to the baking sheet then press it down into the pan. Use your fingers to dimple the dough then drizzle the top with the remaining 2 tablespoons of the garlic-olive oil mixture. Let the dough rise for 20 minutes until it puffs slightly.\nThis is where I slightly deviated from the website's recipe.\nI added sliced bell pepper, cherry tomatoes, kalamata olives, black olives, green olives, cauliflower, and sprigs of thyme, rosemary, dill, and chives for the springtime decor. Just pressed slightly down into the dough. Then back to the original recipe.\nBake until golden brown, 15 to 20 minutes. Cool baked focaccia bread on a wire rack. [I ended up lowering the heat to 350 after 15 min and continued baking for another 6-ish minutes. It was slightly hard to the touch at this point instead of springy and I was worried I had overcooked it, but once it cooled and we cut into it, it was PERFECT.]\n", "Of course kids love this. I'm an adult but I also can finish a bucket of this ;)\nSo crunchy yet juicy, and the kimchi mayo helps bringing this dish to another level of deliciousness! \nINGREDIENTS:\nA. For chicken & marinate:\n\n500g of boneless, skin on chicken meat (thigh/breast)\n3 smashed cloves of garlic\n1 egg white\n1tbs Korean soy sauce\n1.5 tbs sesame oil\n½ tsp white pepper powder\n1 tbs corn starch\nA sprinkle of salt\n\n​\nB. For Kimchi Mayo: (start with less, taste, then add more if needed)\n\n2 tbs finely chopped kimchi\n2 tbs kimchi juice\n1 tbs sugar\n1tbs Korean hot pepper flakes\nA squeeze of lime juice\n4 tbs mayo\n\n​\nC. For sprinkles:\n\n1 large sheet of nori seaweed\n1 tbs untoasted white sesame seeds\n\n​\nD. For Frying:\n\n7-8 tbs tapioca starch or more if needed\nCanola oil\n\n​\nTIPS:\n- I used chicken thighs with skin on, but you can use chicken tenders or breasts as well.\n- All mayo and kimchi have different level of salt, sugar and acidity. My kimchi was very sour, so I had to add a little more sugar. Because of the differences, make sure to use lesser, so that you can taste and adjust to your own taste bud!\n- Caramelising kimchi helps to tone down the funky smell and takes the raw taste off. Plus, who doesn’t love anything caramelised?\n​\nSTEPS:\nA. Marinating chicken:\n\nCut chicken into bite-sized cubes, then add other ingredients\nMix well and refrigerate for 1 hour\n\nB. Making Kimchi Mayo:\n\nIn a small pan, add 1tbs of oil.\nAdd finely chopped kimchi and fry until caramelized\nAdd sugar and kimchi juice. Reduce and allow the mixture to cool down before mixing other ingredients in.\nIn a bowl, combine all ingredients, then taste and add more sugar/salt/lime if needed. The tanginess and umami of kimchi should come first, with just a little bit of sweetness to balance things up.\n\nC. Making sprinkles:\n\nUse tongs to toast nori seaweed under the lowest flame until crispy\nToast sesame seeds in a small pan until lightly golden\nBlend both into fine powder and set aside\n\nD. Frying:\n\nOn a large tray, add 7 tbs of tapioca starch, add more later if needed.\nDrop chicken cubes and coat well. Make sure they don’t clump together.\nRest for 10 mins\nHeat oil in a wok under medium heat, use chopstick to test the oil. Bubbles = ready.\nDrop chicken pieces into oil. Shake off excess starch if necessary\nRemove once the cubes are lightly golden\nSkim the small bits if needed, then bring to medium high heat for 1-2 mins\nDouble fry the chicken for extra crisp\nRemove once golden brown\nImmediately toss the sprinkles together with the chicken in a large bow\nServe immediately. Enjoy with kimchi mayo and adults, I strongly advice to grab a bottle of ice-cold beer! Cheeeeers!\n\nVideo guide if you are interested!\n", "A. Meat Sauce\n-  2 tablespoons extra-virgin olive oil\n-  3 large carrots, peeled & finely chopped\n-  1 large onion, diced\n-  4 large cloves garlic, minced\n-  1 green bell pepper, diced\n-  16 ounces lean ground beef\n-  8 ounces ground pork\n-  ¾ cup red wine\n-  2 cans, or fresh (28 ounces) diced tomatoes\n- 1 tablespoon tomato paste \n- 1/2 tablespoon ketchup \n-  Course kosher salt (Diamond Crystal Brand) and fresh, or dried, Italian herbs (oregano, rosemary, thyme).\nINSTRUCTIONS\n\nIn a 10 or 12 inch heavy-bottomed stainless steel or cast-iron skillet, heat oil over medium-high heat until sufficiently pre-heated. Add onion and carrots, season slightly with a healthy pinch of kosher salt. Sauté until translucent, about 8 minutes.\nAdd garlic and bell pepper. Continue cooking until garlic is fragrant but not scorched.\nIncrease heat to high. Add beef and pork and cook, breaking apart the meat with a wooden spoon until mostly browned. Approximately 10 minutes.\nAdd wine and deglaze. Boil off the wine until it is mostly evaporated, 3-4 minutes at least.\nStir in tomatoes with all liquid if using canned. Reheat to boiling and then reduce heat to medium-low.\nAdd ketchup and tomato paste \nSeason with more salt and select italian herbs to your liking. \nSimmer the now mostly completed sauce, uncovered, for at least 20 minutes or until the sauce has thickened sufficiently.\nPreheat oven to 375.\n\nB. Béchamel\n-  Metal whisk\n-  2 tablespoons butter\n-  3 tablespoons flour\n-  2 cups of milk, heated to just under a boil\n-  Salt and white pepper\nINSTRUCTIONS\n\nIn a 2 or 3 quart saucepan, melt butter over low heat.\nOnce butter is completely melted and covering the bottom of your saucepan, blend in the flour by small amounts, stirring frequently with whisk.\nOnce all flour is blended in, continue cooking for 2 minutes without browning or coloring the mixture.\nRemove from heat. Allow to slightly cool and then pour in the heated milk in one swift motion. Immediately and quickly blend the mixture together with whisk.\nReturn saucepan to the stove over medium-high heat and continue stirring quickly until the sauce comes to boil.\nBoil for about 1 minute, while stirring, until sauce is thick enough to coat and cling to the back of a spoon.\nRemove from heat and season slightly with kosher salt and white pepper. Careful not to over-season as to avoid overpowering the dish.\nIf sauce is too thin, boil it down while stirring continually until reduced and thickened. If sauce is too thick, simmer and thin out with milk added in a tablespoon at a time. If sauce is lumpy, either strain or blend it and then simmer for a few minutes.\n\nC. Filling\nINSTRUCTIONS\n-  1-2 cups freshly made béchamel\n-  7 ounces, approximate, ricotta cheese\n-  1 cup freshly grated parmesan cheese.\n\nIn roughly equal parts, combine all ingredients, stir well, and taste.\nReserve some parmesan to both top unbaked lasagna and garnish completed lasagna.\n\nD. Assembly\nINSTRUCTIONS\n-  1 package (8 to 9 ounces) of no-boil lasagna noodles.\n\nIn the bottom of a 13x9 baking dish, ladle about 1 cup of meat sauce to evenly coat the bottom of the dish.\nArrange 3-4 (depending on width of noodles) noodles over sauce, careful not to overlap or touch sides of the dish.\nLadle 1 ½ cups meat sauce over noodles.\nSpread about ¾ - 1 cup of filling over meat sauce. Best method is to use a tablespoon, dropping dollops across the layer and then spreading slightly. The filling will loosen while cooking so it does not have to be perfect.\nRepeat steps 2-4 with all remaining ingredients until you finish with a final layer of meat sauce.\nTop assembled lasagna with filling and freshly grated parmesan.\nCover with foil and bake 30 minutes in preheated oven at 375.\nRemove foil and bake for 15 additional minutes.\nRemove dish from the oven and raise oven rack to the highest position. Set broiler to high and place uncovered lasagna on topmost rack directly under heat elements. Broil carefully, with over door ajar, until the top is perfectly crisped and brown.\nTurn off heat, remove from oven and rest for a minimum of 15 minutes.\nWith a serrated knife, divide lasagna into equal portions and guide your cuts by the small gaps between noodles.\nServe garnished with fresh chopped parsley and grated Parmesan cheese. Pair with peperoncinis and the rest of that bottle of red wine.\n\n", "The dumplings are intriguing.  I def want to make this. Thanks so much for posting this recipe and the beautiful pic of the dish.\n", "Chocolate Crinkles cookies:\n1/2 cup I bleached AP flour (I used King Arthur’s)\n1/4 cup Dutch price eased cocoa powder \n1/2 teaspoon baking powder\n1/8 teaspoon baking soda\n3/4 cup packed brown sugar\n1 large egg plus 1 egg yolk\n1/2 teaspoon vanilla extract \n2 ounces unsweetened chocolate ( I used semi sweet Ghirardelli chocolate chips)\n2 tablespoons unsalted butter\n1/4 cup sugar ( I used bakers sugar, super fine and found it at Safeway)\n1/4 cup powdered sugar\nPreheat over to 325 degrees\nIn medium bowl sift and whisk together flour, cocoa, baking powder, baking soda and salt.\nIn a large bowl, whisk brown sugar egg, yolk and vanilla until combined.\nMelt chocolate chips and butter in microwave until melted (I did two times 30 sec) use rubber spatula to stir chocolate mixture until we’ll combine and shiny.\nAdd chocolate mixture to  brown sugar mixture use a spatula until well combined, then add flour mixture until no more flour is visible. Let dough sit at room temp for 10 min.\nPlace sugar in a shallow dish and powdered sugar in a another shallow dish.\n(For this part I used a ice cream scooper) \nUse your hands to Roll the dough into 12 balls ( about two table spoons) drop balls directly in sugar and roll to coat then transfer the balls to into the dish with powdered sugar.\nPlace dough balls on parchment  lined baking sheet, leaving 2 inches between.\nBake cookies until puffed and cracked. Edges have begin to set but center is still soft 11 min.\nLeave to cool for 30 min and enjoy! They are soooo good!\n", "You can also watch the recipe video here if you prefer:  https://youtu.be/4vkjlM7p2bo\n2lbs russet potatoes\n1 egg\n1 1/2 Cups all purpose flour\n2t salt.\nPeel and cube the potatoes to an even size and boil for 15-20 minutes until fork tender\nstrain potatoes and pass through a potato ricer, or mash until no lumps remain.\nlet potatoes cool for 15 minutes, and then add egg, salt and flour, mix with your hands to combine until a it all comes together to form a dough.\nSeparate dough into two and work with one half at a time rolling into even cylinders about 1/2 inch in diameter.\nCut into 1 inch long pieces.\nEither poke a divot in the center with your index finger, or roll against a gnocchi board or fork to shape.\nCook immediately or freeze on a sheet pan and then move into a zip top bag for storage.\n", "Cream Cheese Garlic Bread (Korean Street Food) Recipe (6 breads)\n**** If you want to cut the calories: reduce sugar and cream cheese amount in the cream cheese mixture (or even skip the cream cheese). Just dip store-bought buns into the super quick and easy to make garlic sauce, bake the breads at 160C for 10 minutes and you will have a wonderful breakfast or snack during the day\nIngredients: \n1. The bread (if you want to save time, you can always use store-bought soft buns):\n150ml warm milk \n20g (1.5 tbsp) sugar \n4g (1 tsp) instant yeast \n280g (2 cups + 3 tbsp) bread flour \n1g (1/4 tsp) salt\n1 medium egg \n30g (2 tbsp) soft unsalted butter \n2. The cheese sauce:\n400g (1 2/3 cup) cream cheese \n80g (1/3 cup) heavy cream \n50g sugar \n*3. Butter garlic sauce: *\n200g butter (1 cup)\n50g minced garlic (6 tbsp) \n20g honey (1 tbsp) \n50g sweet condensed milk (2.5 tbsp) \n1 egg \n1 tbsp dried parsley\n** Instruction:**\n*1. Bread making: *\n\nIn a bowl, add luke warm milk + sugar + instant yeast, mix thoroughly\nAdd in bread flour + 1 egg + salt, mix well and let it rest for 15 mins\nAfter 15 mins, use a hand mixer knead at 3/6 level for 1 minute\nAdd in 30g soft butter, continue kneading for 4 minutes\n\n_ Grease another clean bowl, put the dough inside and cover with cling film, put it in warm place until the dough rises double in size (about 1 hour)\n\nAfter 1 hour, knead the dough by hand for 1 - 2 minutes to release gas inside the dough\nDivide the dough into 6 equal parts, shape into 6 small balls\nPut 6 balls into a floured tray, cover with wet towel or cling film and let them rise the 2nd time ( about 1 to 1.5 hour)\nBake them at 180C for 20 mins\n\n2. Cream cheese sauce:\n\nSoften cream cheese (room temperature)\nAdd sugar, mix to dissolve\nAdd heavy cream into 2 batches, mix to combine\nPour into the piping bag and keep it in the fridge for later use\n\n3. Garlic sauce\n\nMelted butter and off the heat\nAdd in garlic + honey + sweet condensed milk + 1 egg + dried parsley\nMix until well combined\nSlice the bread into 6 or 8 equal segments without cutting through the bottom\nPipe cream cheese mixture in between segments\nDip the bread into the garlic sauce\nBake at 160C for 10 mins\n\nvideo instruction:\nhttps://youtu.be/0M3cyKk9aT4\n", "Looks great. \nIn the Philippines we call it \"puto\". Funny name but really delicious.\n", "I thought it would be cool to make a very traditional Ragu alla Bolognese; i.e. the sauce that was the catalyst for the famed 'Spaghetti Bolognese' dish a lot of us know and love. This dish is said to have originated in Italy's Bologna region hence the name. For anyone interested it was Pelligrino Artusi who first published ragu as a recipe back in 1891.   \nThe below recipe is just for the ragu sauce - it will make enough to top 6 servings of pasta. Best pasta to serve this with is tagliatelle, fettucine, or pappardelle. \nPrep Time: 30 minutes\nCook Time: 3+ hours\nTotal Time: Approx 6 hours\nServings: 6\nEQUIPMENT\n\nSaucepan\n\nINGREDIENTS\n• 250g beef, hand minced (chuck, brisket, short rib, shank all work)⁣\n• 250g pork, hand minced (shoulder is best)⁣\n• Extra Virgin Olive Oil⁣ (EVOO)\n• 1 onion, diced⁣\n• 1 rib celery, diced⁣\n• 1 carrot, diced⁣\n• 2.5 tbs tomato paste (concentrated)⁣\n• 1 cup red wine⁣\n• 1 cup stock (chicken or beef) + more for topping up ⁣\n• 1 cup whole milk⁣\n• 1 cinnamon stick⁣\n• 1 bay leaf⁣\n• a largish segment of lemon peel⁣\n• A little pinch of nutmeg⁣\n• Salt & black pepper to taste\nINSTRUCTIONS\n\nUse a sharp knife or a heavy cleaver to finely chop the meat into a course mince.\nHeat a heavy bottomed pot on high-heat add enough EVOO to cover the bottom about 1/4 inch thick then add beef and saute for 6-7 minutes until browned on the outside. Remove the beef with a slotted spoon ensuring you leave rendered fat in the pot and set aside.\nRepeat the above step for the pork.\nAdd onions, carrot, celery and saute for 15 - 20 minutes.\nAdd red wine, then the beef and pork back in, then tomato paste, stock, milk, cinnammon, bay leaf, nutmeg, lemon peel. Give everything a good stir and season with salt (about 1 tbs) and black pepper\nSimmer on low heat for 3-6 hours - taste every half an hour; if it gets dry top up with either water or stock. It's done when the meat is tender and no longer chewy; obviously the longer you cook the more tender/melt in your mouth it will get. \n\nTO SERVE\n\nTagliatelle Egg Pasta (cook according to packet instructions and add as much ragu as you like and a dash of reserved pasta water to make it a little saucy) \nGrated Parmiggiano Reggiano cheese \nCracked Black pepper \nGlass of Red Wine!  \n\nFor those interested, below is a 2 min video of cooking process end to end.\nRagu alla Bolognese Vid \n", "i want it inside me\n", "The original recipe\nIngredients:\n\n1 tbsp olive oil\n1 onion\n2 cup chicken broth\n2 tbsp soy sauce\n1 lb fresh chicken breast\n4 oz mushrooms\n2 cup snow peas\n1 tsp fresh ginger\n1 tsp paprika\n1 clove garlic\n2 squares ramen noodles\nfresh cilantro\nsalt\npepper\neggs\nradish\nsesame seeds\nsesame oil\n\nInstructions:\n\nPrep the ingredients: finely chop the garlic and ginger, slice the onion and mushrooms, and trim the snow peas.\nTurn on the sauté mode on the Instant Pot. When fully heated and hot, add the olive oil. Add the garlic, ginger, paprika, onion, and mushrooms and sauté for about 3 minutes, stirring occasionally.\nAdd the chicken and cook until both sides turn golden brown. Season with salt and pepper. Stir in the soy sauce and add the chicken broth. Close and lock the lid. Cook on high pressure for 10 minutes. Once done cooking, do a quick release and release the steam.\nScoop out the chicken and shred using two forks.\nStir in the noodles and cook for about 5 minutes or until al dente.\nStir in the shredded chicken and snow peas. Sprinkle with fresh cilantro and serve. Optional toppings: soft boiled eggs, thinly sliced radish, sesame seeds, and a drizzle of sesame oil.\n\nEDIT: I'm so happy to see so many people excited to try this recipe! I hope everyone enjoys it :)\n", "I've never made anything with dough before, here is my version of the recipe I found:\nRecipe: Cinnamon Rolls\nIngredients\nDough\n\n1 cup whole milk warmed (105-140°)\n2 packages (or 5 teaspoons) active dry yeast\n1/2 cup granulated sugar\n5 cups all-purpose flour separated (plus extra for rolling out the dough)\n3 large eggs room temperature\n1/2 cup unsalted butter room temperature, cut into chunks\n2 teaspoons fine sea salt\n\nFilling and Glaze(Egg wash)\n\n1 egg, room temperature, slightly beaten for sealing edge and egg wash on top\n3/4 cup firmly-packed light brown sugar\n2 tablespoon ground cinnamon\n1/4 teaspoon fine sea salt\n1/3 cup unsalted butter, room temperature, separated\n\nIcing\n\n1 block Cream Cheese\n1 cup Powdered Sugar\n1 tbs unsalted butter\n1/8 tsp vanilla\n\nDirections\n\nGrow the yeast: Add the warmed milk to the bowl of a stand mixer fitted with a paddle attachment or just in a bowl. The milk should feel very warm to the touch, but not scalding hot. Use a thermometer to gauge exact temperature if desired. Sprinkle over the yeast, and stir to moisten. Allow to stand until foamy, about 5-7 minutes.\nMake the dough: Add sugar, 4 1/2 cups of flour, eggs, butter and salt to the yeast. Place remaining 1/2 cup of flour in a small bowl. Mix on low just until the contents of the stand mixer come together. Do not over mix. Double check to makes sure you have added all of the aforementioned ingredients before moving on to the kneading stage.\nKnead the Dough: I kneaded by hand for 10 minutes, adding in bits of the last of the flour as necessary. Here is from the recipe: Remove the paddle attachment and attach the dough hook. Knead the dough on low speed (e.g. speed 2 if using a KitchenAid® stand mixer), and continue to so for 5-7 minutes, adding in the reserved flour 1 tablespoon at a time, as needed, to prevent the dough from sticking to the sides of the bowl. Alternatively, knead the dough by hand.\nDough Rise: Have ready a large oiled bowl. Once the dough is properly kneaded, appearing smooth and elastic in texture, transfer to the oiled bowl and turn to coat. Cover the bowl loosely with plastic wrap, and allow to proof in a warm, draft-free spot until it doubles in size, 1 1/2 - 2 hours.\nFilling:  Have ready a greased 9x13” baking dish, and prepare the egg wash by beating together the egg with 1 tablespoon of water. Set aside until ready to use. To make the filling, in a small bowl, combine brown sugar, cinnamon and salt. Set aside until ready to use.\nRoll 'em out: Punch down the dough and turn it out onto a lightly floured work surface. Cut in half with a sharp knife. Set one half aside, and begin working with the other. Lightly dust the dough with flour. Pat out the dough into the shape of a rectangle. Using a rolling pin dusted with flour, roll out the dough into a rectangle, measuring close to 12 x 14”. Rotate the dough (if necessary) so that one of the short sides is in front of you.\nFill 'em: Spread half of the butter across the surface of the dough, stopping about 1” from the short side opposite of you. Sprinkle with half of the cinnamon sugar mixture, and rub across with the butter, patting to adhere and taking care to leave cleared space at end for egg wash. Brush the clear area lightly with the egg wash. Set aside egg wash and reserve.\nRoll 'em up: Starting on the short side closest to you, begin rolling into a log. Once rolled, pinch together the seam and place seam-side down on your work surface. Using a sharp serrated knife, cut off the tapered ends and discard.\nCut Rolls: Cut the log into 6 equal pieces. Stagger the rolls evenly across half of the greased baking dish. Repeat with the remaining log, and proceed to fill the dish. You should have 12 cinnamon rolls total. I wasn't careful enough with forming, rolling out, or cutting, so I got 16 and cooked the ends also. Unflavored dental floss is best for cutting them, slide a piece underneath and wrap it around up to the top and cross the strings and pull.\nSecond Rise: Cover the rolls loosely with a kitchen towel, and allow them to rise in a warm, draft-free spot until they have doubled in size, about 40 minutes.\nBake: Place a rack in the center of your oven and preheat to 350°. Brush the reserved egg mixture across the top of the cinnamon rolls. Bake the cinnamon rolls for 25-30 minutes, until golden and cooked through. Set aside and allow to cool slightly.\nIcing: Whisk room temp icing ingredients until smooth. Pour across rolls and spread.\nInhale\n\n", "The \"cozonac\" is found everywhere in Romania - it's made every time we're celebrating something important, such as Christmas.\nThe ones I made here are filled with a walnut and cocoa paste, flavored with vanilla and rum essence. Other varieties exist, such as the very popular turkish delight cozonac.\nIt's a difficult dough to knead by hand because it requires lots of effort and strong arms. I'd rather not attempt it without a stand mixer but that is up to you. The short story is: you want to knead it until you're able to grab a piece with both hands and stretch it to a semi-transparent film that doesn't break.\nHere is a video version of the recipe, which should help especially when it comes to rolling the cozonac. It's in Romanian but I translated the steps.\nhttps://www.youtube.com/watch?v=wa6HlVP5LV0\nIngredients for two small or a single large cozonac:\nFor the dough:\n\n500 to 550 grams of flour (I used \"000\" flour which I think is equivalent to \"pastry flour\")\n250ml milk\n8 egg yolks (size M)\n100g powdered sugar\n25g granulated sugar\n25g fresh yeast (or the equivalent dry yeast, as indicated on the package)\n100g butter\n25ml oil with neutral taste (such as refined sunflower oil - note that unrefined sunflower oil does carry taste and smell)\n1 tbsp rum essence\n1 tbsp vanilla essence\nthe zest of a lemon, a similarly sized orange or a combination of the two\na good pinch of salt\n\nFor the walnut filling:\n\n350g crushed walnuts, I like them very finely crushed but you can leave some chunks in if you want\n100ml milk\n200g granulated sugar\n1 tbsp cocoa powder (I used dark cocoa powder)\n1 tbsp rum essence\n1 tbsp vanilla essence\n2 egg whites (size M)\n\nYou'll need some oil, a yolk or two and some milk for finishing as well.\nSteps (dough):\n\nPlace 50g of the flour in a bowl, and get 100ml of milk boiling. Once boiling, pour it over the flour and mix well. Take 25g of yeast and 25g of granulated sugar and beat them together until you get a liquid. You can do this in the same bowl if you're sure the yeast won't touch the hot flour paste. Wait until the flour paste has cooled down and then combine the two together, spread some flour on top, cover with a towel and let rise in a warm place until it's doubled in size. This will be our \"scalded starter mix\".\nOnce that's done, place the remaining flour in your stand mixer's bowl, together with the lemon/orange zest. Mix on the lowest speed, just to combine.\nBeat the egg yolks with a good pinch of salt, the oil, the rum and vanilla essences and then mix with 150ml of lukewarm or room temperature milk.\nAdd the liquid mixture obtained above to the stand mixer bowl, together with the scalded starter mix that should've risen by now. Turn on the stand mixer on low at first, and gradually increase the speed to a medium-high, until all ingredients are completely combined.\nKeep mixing, add the powdered sugar, half of it at a time.\nOnce the powdered sugar has been added, continue mixing on a high speed for another 10 minutes.\nYou may need, every now and then, to stop the mixer and scrape the dough from the bowl and the attachment. This dough is very very sticky. At the end we'll cover our table in oil and the thing will most likely still stick to it in some places.\nAfter 10 minutes it's time to add the butter, in small chunks. Don't add the next chunk until the previous is completely incorporated.\nOnce the butter has been completely incorporated, keep mixing at high speed for another 15 minutes. Unless you've chosen to do it by hand, in which case you'll have to give the dough a real good smashing for 45 whole minutes. You're pretty badass if you chose this route, not gonna lie.\nRemember the doneness test: you want to knead it until you're able to grab a piece with both hands and stretch it to a semi-transparent film that doesn't break.\n\nPlace the dough in a bowl that's been greased with oil, cover with a towel, and let to rise until doubled in size in a warm place.\nSteps (filling):\n\nPlace the crushed walnuts in a bowl.\nBring 100ml of milk and 200g granulated sugar to a boil, mixing continuously to dissolve the sugar properly.\nPour the hot milk & sugar mixture onto the walnuts and mix well.\nAdd the cocoa powder, vanilla and rum essences, the two egg whites, and mix again. Some people choose to beat the egg whites first, I added them as they came out of the egg. Works either way.\n\nFinal steps (refer to the video I linked above to best get these steps right):\n\nThe dough should've risen by now. Spread some oil on your working surface, take the dough out of the bowl and spread it into a rectangular shape that's fairly thin. You can do this by hand because the dough is extremely easy to shape.\nIf you want to make two portions, cut the rectangle in two. Once rolled, the dough should fit in your rectangular loaf tins so keep this in mind.\nCover the dough with the walnut filling, leaving out a couple of centimeters around the filling to help with the rolling.\nRoll from top to bottom, constantly bringing the sides of the rectangle towards the inside.\nMake sure you've rolled it well and securely sealed it.\nPlace a baking sheet in your pan, making sure to cover the sides properly, then very carefully place the rolled up cozonac in it. Careful, it's fragile, so get your fingers underneath it from the get-go.\nBeat an egg yolk with a tablespoon or two of milk, and carefully brush the surface of the cozonac.\nLet it sit covered in a warm place for 45 mins or so, or until it increased in size and reached the top of the pan.\nIn the meantime, preheat your oven to 190 degrees celsius.\nGet the cozonac in the oven, and let it bake for about 10 minutes, at which point you want to cover it with aluminium foil and bake for another 40 minutes.\nTake out of the oven, let cool down a bit in the tin, then take them out and let cool further on a rack.\n\nNormally you don't cut into them until they're completely cooled, but rules are made to be broken. I like to eat pieces of the crust while it's still hot. Enjoy!\n", "INGREDIENTS\n1 lb skinless pork belly, cut into 2 long strips (450 g)\n2 tablespoons finely chopped garlic\nChar Siu Sauce:\n2 pieces Chinese fermented red bean curd\n1 tablespoon maltose or honey\n1 tablespoon Chinese Shaoxing wine\n1 tablespoon soy sauce\n1 tablespoon oyster sauce\n1 teaspoon dark and thick soy sauce\n1 teaspoon five-spice powder\n1/4 teaspoon white pepper powder\n3 1/2 oz sugar (100 g or 8 1/2 tablespoons)\nINSTRUCTIONS\nGet a big bowl, mix all the Char Siu Sauce ingredients, add the garlic and pork belly and marinate overnight in the fridge.\nThe next day, heat the oven to 400 degrees F (200 degrees C).\nPlace the pork belly on a wire rack or in a pan lined with aluminum foil. Roast for 15 minutes.\nRemoved from oven and turn the pork belly over, brush the remaining Char Siu Sauce on the pork. Continue to roast for another 15 minutes.\nSet the oven to Broil and broil each side of the pork belly for about 1 min, until each side become nicely charred. The char siu will look dark in color, it's normal.\nYou may heat up the remaining Char Siu Sauce and bring to a simmer. Set aside.\nSlice the char siu into thin and bite-size pieces, serve immediately with steamed white rice and the remaining Char Siu Sauce.\n-Alternative cooking method: if you don't want to roast in the oven, cut the pork into long strips, and fry them in a pan over medium heat until each side is nicely browned\nRecipe by Rasa Malaysia\n", "Ingredients\n4.5 cups water\n8oz elbow pasta\n2-3 cloves garlic, minced\n2 tbsp butter\n1.5 cups sharp cheddar, grated\n1 cup heavy whipping cream\n1 tsp thyme\n1.5 teaspoon onion powder\n1 pinch of dried parsley \nSalt, add to taste\nDirections\n\nBoil water in a pot. Add pasta and cook for 7 min or Al Dente. Drain and set aside.\nIn a deep pan add the butter on medium low heat and saute garlic for 3 minutes or until fragrant. Slowly pour in whipping cream a little at a time until simmering. Whisk in shredded cheese a little at a time making sure it's melted before adding more. Add seasonings and simmer until thickened. \nAdd pasta to cheese sauce and stir. \nServe hot. \n\nServes 3-4 people. :)\nedited to add whipping cream\n", "This is adorable\nI'm totally doing this, thank you!\n", "Who doesn't like super crunchy shortbreads that melt in the mouth? Quick in preparation with a cool shape that will surprise your friends and family.\nLet's get mixer going!\nIngredients (makes around 18 cookies):\n\n220g butter in room temperature\n80g caster sugar\n1/2tsp vanilla bean paste\npinch of salt\n250g plain flour\n100g of milk chocolate chips\n\nInstructions:\n1. Cream butter and sugar until white and fluffy, this should take around 3-4 minutes.(I recommend to use a stand mixer or hand-held mixer with a bowl)\n2. Add 250g of plain flour, 1/2tsp of vanilla bean paste and pinch of salt. Mix ingredients together with a spatula until the dough starts to form (do not use mixer anymore!)\n3. Mix in the chocolate chips and transfer the dough on to a sheet of baking paper, cover the dough with another sheet and roll the dough flat to half-inch thick.\n4. Transfer flattened dough with both sheets of paper onto a wooden board and place in the freezer for 20 minutes.\n5. When ready, remove the dough from the freezer and cut out triangles with a sharp knife, place triangles on the two trays with baking paper (dough will be hard but not frozen at this point).\n6. Once all shortbreads are cut out, place them back in the freezer for 5 minutes and preheat the oven to 165C (329F).\n7. Bake shortbreads for 18 minutes or until edges start to turn golden brown. (If using two trays, swap them places half-way through)\n8. Once baked remove tray from the oven and leave on the side for 5-10 minutes then transfer cookies onto a cooling rack.\n9. Enjoy with a cuppa!\nBlog post: https://www.insightflavour.com/post/chocolate-shortbread-cookie-shards\n", "Recipe :\nFor the dough:\n300 gr/ 10½ oz. / + 2 tbsp. all-purpose plain flour\n5ml/1 tsp. salt\n14 gr/4 tsp. dried yeast (2 packs of 7gr dried yeast)\n8 fl. oz. /1 cup warm water\n45ml/3 tbsp. olive oil\nFor the topping:\n1 medium onion, finely chopped\n400 gr/14 oz. ground beef or ground lamb or mixture\n½ green bell pepper or 1 green pointy pepper, finely diced\n2 medium tomatoes, deseeded and diced\n15 ml/ 1 tbsp. lemon juice\n15 ml/ 1 tbsp. olive oil\nSalt (5 ml/1 tsp. salt is recommended) and freshly ground black pepper to taste\n1 egg + 15 ml/ 1 tbsp. olive oil to brush the pide\n", "Ingredients:\n1. 1 bottle white cooking wine - 12.7 fl oz\n2. 1 yellow onion, coursely chopped \n3. Red pepper flakes, measured with your heart\n4. Pinch smoked paprika \n5. Pinch dill weed\n6. Sprig Thyme\n7. Bay leaf \n8. 3.5 lb fresh mussels, debearded in shell\n9. 3 tbsp butter\n10. 1 thick bunch scallions, white and greens chopped separately\n11. 1 tsp minced garlic (from the jar)\n12. 14.5 oz can whole tomatoes, steam peeled \n13. 1 cup heavy cream\n14. Sprinkle Parmesan\n15. Freshly ground black pepper\nDirections: \n 1. Add your wine, onions, thyme, bay leaf, dill weed, paprika and red pepper flakes to a medium/large pot. Cover and cook for about 10 minutes. \n2. Add your mussels to the pot, cover again, and let them steam for about 10 minutes, until they’re fully opened. \n3. Strain the muscles into a colander and deshell them into a bowl. While you’re doing this, let the wine mussel broth rest so that all of the grit remains at the bottom. \n4. Melt your butter into another medium-large pot, add the garlic and white parts of your scallions - cook until soft. \n5. Add your tomatoes and all liquid from the can, crushing the tomatoes by hand as you put them in the pot. Simmer for about 10 minutes.\nNow add the broth, pouring carefully and slowly - you’ll see the bits of grit at the bottom, staying in the broth pot. \n6. Add your cream, and simmer for another 10 minutes.\n7. Reduce the heat to medium-low, add your mussels and scallion greens and cook for another 4 minutes until mussels are heated all the way through.\n8. Sprinkle a bit of Parmesan and black pepper if you’d like, warm up and butter a baguette for dipping, and enjoy! \nModified from Canal House: Cook Something: Recipes to Rely On - Jim’s Mussel Scallion Soup\nETA: Serves ~4 \nMy boyfriend & I made this last night and have about 2 servings left over after having this for dinner. Really hit the spot for a cold evening!\n", "I’ve tried a lot of pancake recipes but I think this is by far the best one yet, it’s super fluffy and soft and delicious 😋 \nThis is the recipe that I used that I found on youtube, but modified one or two things:\n210g of flour,\n50g of sugar,\n12g of baking powder,\n3g of salt,\n2 eggs,\n240ml of milk,\n5ml of vanilla extract,\nSunflower oil (I usually just add like two teaspoons of that to the mixture and then add a little bit to the pan for the first pancake and wipe the excess with a paper towel).\nAnd this the video that explains how to make it and contains the original recipe which is pretty much the same: \nhttps://youtu.be/4zO87oc_r-c\n", "Ingredients \n\nChicken Breast\nBrioche Bun\n1 Cup of flour\n1/2 Cup of corn starch\n1 Cup of buttermilk\n1/2 Cup of mayo\n3 Teaspoons garlic powder\n3 Teaspoons onion powder\n3 Teaspoons paprika\n1 Teaspoon hot sauce (i used franks)\nLeaf Lettuce\nPickle\nFrench Fries\nBrown Gravy\nMozzarella Curds/Cheese Curds\n\nDirections for Chicken Sandwich\n\nChicken breast sliced in half to have a thinner piece and then pound with either your hand or a mallet\nIn a large bowl mix buttermilk, 1 teaspoon of garlic powder, 1 teaspoon of onion powder, 1 teaspoon of paprika, add kosher salt, and pepper\nMarinate for as long as desired (the longer the better)\nIn another large bowl put a cup of flour, 1/2 cup of corn starch, 1 teaspoon of garlic powder, 1 teaspoon of onion powder, 1 teaspoon of paprika, and 1 teaspoon of cayenne (or more if you desire more heat it doesn’t really change any flavor)\nTake chicken out of buttermilk mix and coat in the dry mix and push the mix into the chicken to make sure it’s coated well\nDeep fry on 350 for 5 ish minutes on each side or until it is golden brown (I usually take it out just before and it’ll continue to brown on the paper towel)\nToast your bun on stovetop with butter\nAdd your chicken, lettuce, spicy mayo, and pickles and youre done\n\nDirections for Poutine\n\nFry your french fries\nTop with Cheese Curds\nDump brown gravy all over and enjoy\n\nHope you enjoy\n", "Ingredients\n\nChicken breasts \nAngel hair pasta\n4T butter\n4 cloves garlic minced\n1 1/2 cup freshly grated parmesan\n1 1/2 cup heavy cream\nSeasoning for chicken: 1t old bay, 1t italian seasoning, 1/2t paprika, 1/4t salt, 1/4tpepper\n\nDirections\n\nFor the sauce: In a skillet, melt butter down and then add garlic. Allow the garlic and butter to cook for about 5 minutes (at medium-low heat). Add 1 cup of heavy cream and increase heat to medium. Allow to simmer for about 5 minutes. Reduce heat to low and add 1 1/2 cup of parmesan and remaining 1/2 cup heavy cream. Continue mixing until cheese has melted and sauce has thickened.\nFor the chicken: (I like to fillet chicken breasts in half and then use a meat tenderizer to flatten the breasts out so that they cook more evenly) Coat breasts with oil and then sprinkle spice mixture on. Using a cast iron pan, bring the pan to medium heat and coat bottom of the pan with oil. Cook chicken breasts in cast iron pan.\nCook angel hair pasta.\nCombine sauce with pasta, top with sliced chicken breasts.\n\n", "Animal shaped buns for Lunar New Year\nHaving some fun with making a few fluffy animal buns! One of my favorite lunar traditions. Check out my video if you wanna learn techniques of animal shaping!\nFull video-> https://youtu.be/pblMDRJroDI\nRecipe:\nPlain Buns\n\nAll Purpose Flour (800 grams)\nYeast (8 grams)\nSugar (40 grams)\nWater (400 grams)\nCanola Oil (as needed)\n\nAlternative Buns\n\nPumpkin, Sweet Potato, etc (250 grams)\nAll Purpose Flour (300 grams)\nSugar (40 grams)\nYeast (3-4 grams)\nWater (as needed)\nCanola Oil (as needed)\n\nOther ingredients for decoration: Food coloring, Dried Dates, Beans, etc\n\nPrepare your choice of starch (potato or pumpkin etc) and peel, cut into small pieces. Steam until it is extremely soft. This can take from 20-40 minutes depending on what you use. Potato takes much longer than Pumpkin.\nMush and mix into a paste, then add the sugar and yeast, give it a mix. Start adding flour in increments and begin to knead the dough together. Dough should feel very flexible, but not sticky. Knead for about 5 minutes then let the dough rise for 30 minutes. Knead for another 3 minutes and let rest for 1.5-3 hours or until doubled in size.\nAt this point if the dough still feels kinda sticky you can knead in some more flour. Knead into a ball and cover with saran wrap. Take small pieces of dough out and mold the dough into whatever shape you need. Watch video for some technique and examples.\nOnce finished, let each bun rise for another 20 minutes and then steam for 15 minutes. Be sure you have some parchment paper under each buns. Done!\n\nTo prepare plain white dough:\n\nMix a cup with water, yeast and sugar. Then add in increments into a bowl with flour and begin kneading. Same exact steps as above. Knead, rest, knead and rest. Then shape as needed.\n\n", "Made using Paul Hollywood's recipe book.\nIt tasted amazing!\n", "Tortellini in brodo is my favourite meal. Looks amazing\n", "Ingredients\n\n2 tablespoons salted butter\n4 cloves garlic, finely diced\n21 oz (600 g) mushrooms, washed and dried with paper      towel (I used Cremini)\n1 small onion, chopped\n1/2 cup white wine, (OPTIONAL) (I substituted with      chicken broth)\n5 oz (150 g) jarred sun dried tomato strips in oil, (reserve      1 tablespoon of the jarred oil for cooking)\n1 1/2 cups heavy cream\nSalt and pepper, to taste (I did not add any salt or      pepper)\n3 cups baby spinach leaves, washed\n1/2 cup fresh grated Parmesan cheese\n1 teaspoon cornstarch, OPTIONAL — (mix cornstarch with      1 tablespoon water for a thicker sauce.\n1 teaspoon dried Italian herbs\n1 tablespoon fresh parsley, chopped (I used dried      parsley)\n\nInstructions\n\nHeat a large skillet over medium-high heat. Melt the butter and sauté onion until transparent; add the garlic and cook until fragrant (about one minute). Cook the sun dried tomatoes and oil in with the butter for about 2 minutes to release all of their flavours. Cook mushrooms in the tomato flavours for about 5 minutes.\nPour in the white wine or broth (if using), and allow to reduce to half, while scraping any bits off of the bottom of the pan. (SKIP THIS STEP IF YOU WISH.)\nReduce heat to low-medium heat, add the cream and bring to a gentle simmer, while stirring occasionally. Season with salt and pepper to your taste.\nAdd in the spinach leaves; allow to wilt in the sauce, then add in the parmesan cheese. Allow sauce to simmer for a further minute until cheese melts through the sauce. (For a thicker sauce, add the milk/cornstarch mixture to the center of the pan, and continue to simmer while quickly stirring the mixture through until the sauce thickens.)\nMix in the herbs and garnish with parsley. \nServe over mashed cauliflower, zucchini noodles or steamed veg. Alternatively, serve over pasta, mashed potatoes or rice.\n\nNow that I’ve made this dish, I think boiling some gnocchi and adding it in at the end would be amazing. The sauce would also be great for dipping some fresh bread in.\n", "Video recipe here\nIngredients\n\n140g egg whites\n1 tsp lemon juice\n50g sugar\n70g egg yolk\n55g flour\n15g cornstarch\n1/4 tsp salt\n45g milk\n45g oil\n1 tsp vanilla extract\n3 large strawberries, sliced\n200g heavy whipping cream\n15g sugar\n5g vanilla pudding powder\n\nDirections\n\nPreheat the oven to 340F. Line a 9 inch x 9 inch cake pan with parchment paper.\nAdd lemon juice to the egg whites and beat on medium speed until thick and foamy. Gradually add in 50g sugar and continue beating until meringue reaches stiff peaks.\nWhisk the egg yolks lightly to break them, then pour into the meringue and gently fold with a whisk until well incorporated.\nSift in the flour, cornstarch and salt. Gently fold with whisk until no lumps remain.\nAdd the milk, oil and vanilla extract, again folding in with a whisk.\nUse a spatula to fold the batter one more time, making sure to scrape the sides and bottom of the bowl.\nSlowly pour the batter into the lined pan. Smooth out the top with the spatula, then run a toothpick through the batter to remove air bubbles. Carefully bang the pan a few times on the counter to remove any remaining air pockets.\nBake at 340F for 25 minutes until toothpick inserted into the centre comes out clean. Remove from pan and let cool completely before icing.\nTo make the whipped cream icing, beat heavy whipping cream with sugar on medium speed until stiff peaks form. Add the instant pudding powder and beat for another 30 seconds to incorporate.\nCut the cake in half and spread a thing layer of whipped cream evenly (about 1/4 of the total cream) over one half. Place the strawberry slices on top, pressing them down into the cream a little. Spread more cream over the top so that strawberries are completely covered.\nGently place the other half of cake on top. Cover with the remaining whipped cream.\nChill the cake for about an hour to help set the cream and create a cleaner cross section. Trim off the edges with a sharp knife and decorate the top with halved strawberries.\n\n", "Great idea! Think I will make one tomorrow with potato bread and add Cajun seasoning to the egg wash!\n", "**RECIPE**\nIngredients\n\nCrawfish Tails, cooked and peeled, 2lb\nButter, 2 Sticks\nOnion, 4 x Large Sweet and chopped\nCelery, 6 x Stalks chopped\nGreen Bell Pepper, 2 x Large Chopped\nBayleaves, 4 x Large\nFlour, All Purpose 2 Tbsp\nSalt, 2 tsp\nCayenne, 1/2 tsp\nParsley, fresh 4 x Tbsp chopped\nGreen Onion, 6 x Tbsp chopped\nStock, 2 Cups (see below)\n\nSeafood Stock\n\nCrawfish peelings (pan full)\n2 x Onions 2 x Garlic Bulbs from crawfish boil\n\nInstructions\n\nMake seafood stock - this can be done ahead of time if needed. Take a pan full of crawfish peelings and some vegetables (onions/garlic) from your crawfish boil and boil with water - covered - for an hour. If you do not have the ability to do this step you can just use store bought seafood stock.\nIn a pan melt all the butter.\nAdd the chopped onions, bell pepper and celery (the trinity)\nCook on medium heat for about 3 minutes - until the vegetables are clear and soft.\nAdd the flour and continue to cook a further 3 minutes.\nAdd crawfish tails and cook 2 more minutes.\nAdd all bayleaves, continuing to stir.\nSlowly add the stock, stirring and you'll see it start to thicken up. Add the salt and cayenne and cook for 5 minutes.\nAdd the Parsley and green onions and cook for another 5 minutes.\nServe over rice.\n\nNotes\nHow the crawfish was originally boiled (seasoning) will determine how spicy this dish is. Depending how much heat you like in your food, the Cayenne can be always increased.  \nSOURCE:  https://thecaglediaries.com/recipes/dinner-recipes/crawfish-etouffee/\n", "Lies! You didn’t harvest the cacao bean for the cocoa powder or milk the cow for mascarpone!\nBut actually, this is a fantastic idea and looks so tasty I’d set aside the lies for a slice.\n", "[removed]\n", "Recipe Video:  https://www.youtube.com/watch?v=i4MzmFhYvQw\nRecipe:\nMakes two 10 inch pies\nDough:\n-1 packet of dry active yeast\n-1 cup warm water\n-2 Cups of bread flour\n-1 tsp salt\n-2 tsp sugar\n-Glug of Olive oil\n​\nDirections:\n\nMix sugar, water and yeast into bowl and let yeast bloom\nMix in all other dough ingredients\nRun through a stand mixer or kneed with a wooden spatula and then your hands when the dough becomes manageable enough to work with (adding in flour little by little helps)\noil up a bowl and plop your dough into the bowl while shaping into a ball\nLet rest for 12-24 hours in the fridge covered in plastic wrap\n\n​\nPizza:\n-Dough\n-Olive oil\n-Seasonings for bottom of pie (salt, pepper, oregano, garlic powder etc)\n-Full fat low moisture mozzarella (most important ingredient)\n-Parmesan cheese\n-Toppings \n-Sauce\n​\nDirections:\n\nHeat oven to its highest setting (450-500 usually works perfect for me)\nDivide dough into 2 pieces\nSeason cast iron pan with oil and seasonings\nstretch dough over your hands then place into pan and stretch more. Let rest for 30 minutes.\nMake your sauce, grate your cheese and prep your toppings while dough proofs\nNow that the dough has relaxed, stretch to the edge of the pan\nTurn stove-top to medium high heat, rotating the pan around the heat to develop a crust\nSpread sauce all the way to the end and rotate until all sides begin to bubble a little bit\nPlace on cold cheese/toppings ALL THE WAY TO THE END of the pan (most important step)\nPlace into oven and babysit until your cheese reaches its desired crispiness\nLet sit in the pan for 5 minutes, then place on a cooling rack for a few more minutes\nSlice up and enjoy!\n\n", "\n3 tablespoons extra-virgin olive oil\n1 large onion, halved and thinly sliced\n1 large red bell pepper, seeded and thinly sliced\n3 garlic cloves, thinly sliced\n1 teaspoon ground cumin\n1 teaspoon sweet paprika\n⅛ teaspoon ground cayenne, or to taste\n1 (28-ounce) can whole plum tomatoes with their juices, coarsely chopped\n¾ teaspoon kosher salt, plus more as needed\n¼ teaspoon black pepper, plus more as needed\n5 ounces feta, crumbled (about 1 1/4 cups)\n6 large eggs\nChopped cilantro, for serving\nHot sauce, for serving\n\nPREPARATION\n\nHeat oven to 375 degrees. Heat oil in a large skillet over medium-low. Add onion and bell pepper. Cook gently until very soft, about 20 minutes. Add garlic and cook until tender, 1 to 2 minutes; stir in cumin, paprika and cayenne, and cook 1 minute. Pour in tomatoes and season with 3/4 teaspoon salt and 1/4 teaspoon pepper; simmer until tomatoes have thickened, about 10 minutes. Taste and add more salt and pepper if needed. Stir in crumbled feta.\nGently crack eggs into skillet over tomatoes. Season eggs with salt and pepper. Transfer skillet to oven and bake until eggs are just set, 7 to 10 minutes. Sprinkle with cilantro and serve with hot sauce.\n\n", "200 gr biscuits \n80 gr butter\n200 gr dark chocolade\n200 gr milk chocolate\n200 gr white chocolade\n450 ml milk\n600 ml whipping cream\n3 packs (14 gr each pack) of instant gelatine (in Italy it’s trade name is tortagel, it is a gelatine powder that solidifies immediately, so that you don’t have to wait for each layer to solidify. 7 minutes that are needed for preparing each next layer are enough to solidify the previous layer).\nSo, crush buscuits and add melted butter. Distribute evenly the prepared mix into a cake form of 22 cm diameter (with a clamp, for easy opening), making so the base layer. Put in fridge 30 min.\nFor each chocolate layer (white, then milk, then dark): crush 200 gr of chocolate, add 150 ml of milk and 200 ml of whipping cream and one pack of tortagel, heat the mix for 7 min at 90 degrees C (I am doing it with Bimby Vorwerk kitchen appliance which allows me to maintain needed temperature during cooking). Usually 7 min should be enough for chocolate to melt and for all ingredients to mix well. Once done, pour the mix into the stamp. Repeat this step for other two layers. Let it cool in the fridge at least for 4 hours.\n", "Recipe:. https://omgchocolatedesserts.com/peach-cobbler-cheesecake/\nThere still needs to be a final layer of warm peaches/sauced added before serving, which I will make prior to eating. But as is, it looks pretty good.\nEdit: Oh my goodness thank you for the silver!!\n", "send this to my mouth.\n", "These are an easy and epic appetizer I made last nigh\nt.\n.\n.\nGARLIC CHEESE BOMBS\n.\n.\nINGREDIENTS:\n1 can pizza dough\n6 mozzarella string cheese sticks, cut into 24 pieces (I used a light version)\n4 tablespoons butter\n1 1/2 tablespoon garlic bread sprinkle (or garlic powder)\n1 teaspoon Italian seasoning\n.\n￼\nINSTRUCTIONS:\n\nPreheat oven to 375 degrees F. Spray a 10\" cast iron pan with cooking spray and set aside\nRoll out pizza dough onto a lightly floured surface and form into a 12\" x 8\" rectangle\nCut into 24 even squares and place 1 piece of cheese into the center.\nRoll up cheese into dough ball and pinch sides to seal.  Set into prepared pan.\nMelt butter and stir in seasonings.  Spread onto the tops of the dough.\nBake for 25 minutes or until golden brown.\n\n.\n.\nNOTES: \nThis may be obvious but I forgot to completely defrost the dough making it very difficult to roll flat with a rolling pin. So yea... defrost the dough!! \nServe with marinara sauce!!! Yay.\n", "Oh lawd I'm comin\n", "I used this recipe for the crepes. Came out really good! \nhttps://cooktoria.com/sweet-crepes/\n", "Ingredients:\n• 3/4 - 1 cup kimchi \n• 150-200g spam\n• 1 cup leftover rice\n• 1/2 Onion\n• 3/5 cloves of garlic \n• Gochujang\n• Soy Sauce\n• raw sugar\n• Sesame Oil\nInstructions (Ingredients in description):\n\nDice up half an onion and 3-5 cloves of garlic. Mix the gochujang, raw sugar, soy sauce and black pepper together.\nPan-fry slices of spam on all sides, then slice into bite-sized cubes after searing.\nSaute the onion until soft, then add the garlic.\nPlace some sesame oil in the pan, then stir-fry the kimchi in the sesame oil\nAdd leftover rice into the pan and mix well. Add the gochujang mix and stir well.\nFry an egg and serve on top of the rice.\nEnjoy the cheap, spicy, delicious goodness.\n\n", "Recipe here originally: Chicken with Creamy Fennel Broth\nThis chicken with creamy fennel broth is so delicious, spicy, and rich. We topped it with a fennel gremolata so no part of the fennel goes to waste!\nPrep Time: 15 minutes\nCook Time: 40 minutes\nTotal Time: 55 minutes \nServings: 4 \nCalories: 765kcal\nEquipment\n\nSheet pan\nLarge skillet\nLarge pot\n\nIngredients\n\n4 chicken thighs skin-on, bone-in\n2 teaspoons neutral cooking oil for frying\n8 ounces orzo\n2 cups reserved pasta cooking water\n1 fennel bulb with stalks and fronds\n1 yellow onion peeled and diced\n1/2 cup heavy cream\nSalt, pepper, and crushed red pepper to taste\n\nFennel Gremolata:\n\n1/2 cup fennel fronds\n1 lemon juiced\n3 ounces pine nuts\n1 teaspoon fennel pollen optional\nSalt and pepper to taste\n\nInstructions\nFry the Chicken:\n\nPreheat oven to 425ºF. Heat the neutral cooking oil in a skillet over medium-high heat. Once hot, pat the chicken dry and season all over with salt and pepper. Place into the skillet and cook in batches, skin-side down, until the skin is crispy and golden (about 5 minutes).\nAs the chicken finishes cooking, transfer it to a sheet pan, skin-side up. Drain off all but 2 tablespoons of chicken fat and set the skillet aside.\nPlace a small piece of aluminum foil in the corner of the sheet pan and add the pine nuts in an even layer.\nTransfer the sheet pan to the oven. After 5-7 minutes, remove the pine nuts and set aside.\nContinue baking the chicken for another 30 minutes or until an instant-read thermometer reaches 165ºF. Turn off the oven and leave the chicken in the warm oven until you are ready to plate the dish.\n\nCook the Orzo:\n\nBring a large pot of salted water to a boil. Add the orzo and cook until just al dente. Scoop out 2 cups of pasta cooking water and set aside. Drain and rinse the orzo.\n\nPrepare the Fennel:\n\nRemove 1/2 cup of fennel fronds from the stalks. Pick off the remaining fronds and reserve for another use. Thinly slice the fennel stalks into rounds. Remove the core from the bulb and slice the bulb into strips. Set aside.\n\nPrepare the Creamy Fennel Broth:\n\nHeat the skillet used to fry the chicken over medium heat. Once hot, add the fennel and onion and cook, stirring occasionally, for 8-10 minutes until softened and golden brown.\nAdd the reserved pasta cooking water and bring to a boil. Season liberally with salt, pepper, and crushed red pepper. Cook for 5 more minutes until reduced slightly. Slowly whisk in the heavy cream and reduce heat to low. Cook for an additional 5-6 minutes until thickened. Turn off the heat.\n\nPrepare the Fennel Gremolata:\n\nRoughly chop the fennel fronds and toss them in a bowl with the toasted pine nuts. Add the lemon juice, salt, pepper, and fennel pollen (if using) and toss to combine. Set aside.\n\nTo Serve:\n\nDivide the orzo between shallow bowls and ladle the broth on top. Place a chicken thigh on top and garnish with the fennel gremolata. Enjoy!\n\nNutrition\nCalories: 765kcal | Carbohydrates: 57g | Protein: 31g | Fat: 48g | Saturated Fat: 13g | Cholesterol: 151mg | Sodium: 134mg | Potassium: 827mg | Fiber: 6g | Sugar: 4g | Vitamin A: 604IU | Vitamin C: 23mg | Calcium: 106mg | Iron: 4mg\n", "Direct link to recipe: http://cookingfornoobs.co/?p=767Happy Sunday\nINGREDIENTS:\n\nDonuts dough:\n500 gr flour\n200 ml warm milk\n70 gr butter (room temperature)\n2 large eggs (room temperature)\n10 gr dry yeast\n1 teaspoon vanilla extract\n1/2 teaspoon salt\nTopping:\n100 gr dark chocolate\n100 gr dark chocolate\n200 gr heavy cream or heavy whipping cream\n\nINSTRUCTIONS:\nDONUTS:\nIn a small bowl, mix the yeast with a little bit of warm water to dissolve it.\nPut the flour in a large bowl, make a hole in the center then add: the yeast mixture, eggs, vanilla extract, salt, butter and mix using a spoon or your hands. Add the milk little at a time, then knead the dough for several minutes until it is soft and detaches from the sides of the bowl. Cover with a towel and let it rise for at least 1 hour.\nFlour a work surface to roll out the dough, then using a glass or round cutter, cut out donuts. Cover with a towel and set aside for another 30 minutes.\nFry your donuts in heated vegetable or any other frying oil and set in a blotting paper to absorb oil.\nTOPPING:\nI choose to top my donuts with white chocolate ganache, and dark chocolate ganache.\nIn a saucepan, heat the cream over medium heat until it barely begins to simmer. In the meantime, place each chocolate separately in a heat proof bowl after chopping it (the smaller the chocolate pieces are the easier it is to melt). When the cream starts to simmer, pour half of it in each chocolate bowl, let it sit for 2 minutes then stir very slowly until well combined.\nDip the donuts in one of the ganaches, sprinkle with anything you have, like m&ms or any small candies.\nLet the donuts dry for 1 hour before tasting.\n", "Sooo.... i can’t have dairy, and i don’t love making pie dough, so i have swapped in defrosted frozen puff pastry instead (fun fact Pepperidge farms is actually vegan -so no dairy) then i just roll out and stab a bit with a fork so it doesn’t poof too much. \nWhich is totally not at all your recipe here, just an option for any dairy free readers here it’s really delicious and easy :)\n", "For the lemon cupcakes\nIngredients\n\n1/2 cup (115g) unsalted butter, softened to room temperature\n1 cup (200g) granulated sugar\n2 large eggs, at room temperature\n1 and 1/2 teaspoons pure vanilla extract\n1 and 1/2 cups (190g) all-purpose flour (spoon & leveled)\n2 teaspoons baking powder\n1/2 teaspoon salt\n1/2 cup (120ml) whole milk\n1 and 1/2 Tablespoons lemon zest\n1/3 cup (80ml) fresh lemon juice\n\nInstructions\n\nPreheat the oven to 350°F (177°C). Line a 12-cup muffin pan with cupcake liners.\nUsing a handheld or stand mixer fitted with a paddle attachment, beat the butter and sugar together on medium-high speed in a large bowl until creamed, about 2 minutes. Scrape down the sides and bottom of the bowl as needed. Add eggs and vanilla extract, then beat on medium-high speed until combined, about 1 minute. Scrape down the sides and bottom of the bowl as needed. Set aside.\nWhisk the flour, baking powder, and salt together in a medium bowl. Pour the dry ingredients into the wet ingredients, start the mixer on low speed, then slowly add the milk, lemon juice, and lemon zest. Once combined, stop the mixer. Do not overmix this batter.\nSpoon batter evenly into 12 cupcake liners, filling them about 2/3 full. Bake for about 18-22 minutes. A toothpick inserted in the middle will come out clean when they’re done.\n\nBerry Swiss Meringue Buttercream recipe\nIngredients\n\n3 egg whites\n3/4 cup sugar + 1 additional tbsp\npinch of salt\n1/2 tsp lemon juice (or white vinegar)\n12 tbsp butter\n1/2 tsp vanilla extract\n2 cups frozen berries\n\nDirections\n\nSeparate your egg whites from the yolks, making sure not a single drop of yolk ends up in the whites. Place your egg whites in a heatproof bowl. Reserve yolks for another purpose.\nAdd in 3/4 cup of sugar and set the bowl over a pot that is simmering with a couple inches of water.\nWhisk the egg whites and sugar constantly until all the sugar is dissolved. You can use your fingers to feel if there are still granules of sugar in the egg mixture. Then take it off the pot.\nAdd in your salt and lemon juice. Then on medium-high speed, beat the mixture until it reaches stiff peaks. You know you have reached this stage when you can overturn the bowl and none of the meringue falls out. Avoid over-beating.\nAdd in your softened butter about a tablespoon at a time, making sure you mix in between each tablespoon.\nMix in your vanilla.\nOver medium heat, cook the berries with a tablespoon of sugar. Allow the berries to break down, using a wooden spoon to help burst them.\nContinue to simmer and allow the mixture to thicken and reduce down to about a 1/3 cup of liquid.\nTake off the heat and strain the berry sauce to get rid of the seeds and fibers.\nAllow the sauce to cool down before adding to your buttercream.\n\n", "Link to recipe can be found here on BBC good food  - Sticky pork belly bao buns\nFor the pork:\n*1 tbsp sunflower oil\n*800g piece boneless pork belly, cut into thick slices\n*4 tbsp light muscovado sugar\n*3 garlic cloves, sliced\n*thumb-sized piece ginger sliced\n*2 star anise\n*100ml Shaosing rice wine\n*2 tbsp dark soy sauce\n*large pinch of Chinese five-spice powder\nFor the buns:\n*250g plain flour, plus extra for dusting\n*1 tbsp white caster sugar\n*1 tsp baking powder\n*2 tsp fast-action dried yeast\n*50ml milk\n*1 tbsp sunflower oil, plus extra for greasing\nFor the crushed chilli peanuts:\n*handful roasted peanuts\n*1 tsp chilli powder\nTo serve:\n*coriander leaves\n*cucumber batons\n*shredded spring onion\n*Gratted carrot\nMethod\nHeat oven to 160C/140C fan/gas 3. Heat the oil in a flameproof casserole dish over a medium-high heat. In batches, brown the pork belly well, then transfer to a plate. Tip the sugar into the dish and cook over a medium heat until starting to dissolve and caramelise, then quickly stir in the garlic, ginger and star anise, and cook for 1 min.\nCarefully pour in the rice wine and soy sauce – watch out, it will spatter – and simmer to dissolve the sugar. Stir the pork into the caramel to coat, then add 100ml water and the five-spice, and bring to a simmer. Put the lid on and cook in the oven for 1 hr 30 mins. Remove from the oven, uncover, put on a high heat to simmer and reduce the sauce until sticky. Can be prepared up to 2 days ahead and chilled. Reheat with a splash of water.\nTo make the chilli peanuts, mash most of the peanuts using a pestle and mortar, then add the rest of the nuts and roughly crush for a chunky texture. Stir through the chilli powder. Can be made 2 days ahead and stored in an airtight container.\nFor the buns, tip the dry ingredients and a large pinch of salt into a food mixer fitted with a dough hook. Pour in the milk, oil and 100ml tepid water, and work the mixture for about 10 mins until smooth and elastic. Transfer to a greased bowl, cover with cling film and leave to double in size (for about 1 hr)\nTip the dough onto a floured surface and roll into a sausage shape. Cut the sausage into 10 equal portions. Roll each portion into a bun, then use a rolling pin to roll each bun out into an oval. Lightly grease each one, then fold them over a greased chopstick or skewer and place on a lightly oiled baking tray to rest for 1 hr or until doubled in size. Remove the chopstick or skewer before steaming.\nHeat a steamer and steam the buns on circles of baking parchment in batches for about 10 mins until puffed up. Split the buns and stuff each one with a slice or two of the pork, drizzled with some of the sauce. Scatter over some coriander, cucumber and spring onions, then sprinkle with the crushed nuts and tuck in.\n[Edit: updated comment with full recipe which I can't seem to format ... sorry guys]\n", "Source\nCarne Asada\n\n1 lb flat iron steak  \n\nOr a steak of your choice: Skirt steak, hanger steak, flat iron, flat iron, etc.\n\n30 ml Olive Oil\nJuice of 1 Lime\n6 g Salt\n2 g Cumin\n2 g Smoked Paprika\n2 g Ancho Chile Powder\nShot of mezcal or tequila (optional)\n\nMethod:\n\nUsing a sharp knife, slice the steak across the grain into very thin strips. Add the steak to a large bowl.\nIn a separate bowl, add the olive oil, lime juice, lime zest, salt, cumin, smoked paprika, and chile powder and whisk together. Pour the marinade over the steak and mix with your hands. Cover and let sit in the fridge for 30  minutes or up to 6 hours.\n\n\nNote: While the steak is marinating, you can make fresh tortillas! Also if pressed on time, feel free to skip the time in the fridge, it will still be delicious.\n\n\nSet a cast-iron over high heat. When ready to cook, add the shot of mezcal and mix it into the steak. The alcohol will help carry aromas and flavors from the marinade. When the cast iron is ripping hot, let the excess marinade drip off the steak and evenly spread out on the cast iron. Grill until the steak is well charred, remove and set on a platter.\nMelt cheese with the steak and add to a fresh tortillas to make a quesadilla or serve with rice, salsa, or anything else your heart desires.\n\nChipotle Cilantro Chimichurri\n\n1 dried chipotle mecco (substitute 1 chipotle in adobo)\nLarge handful cilantro (stems included)\n1 clove garlic, peeled\n30 ml Olive oil\nJuice from 1 lime\nZest from 1/2 lime\nSalt to taste\nFresh ground pepper\n\nMethod:\n\nIf using dried chiles, remove the stems and seeds. Pour hot water over the chiles and let rehydrate for 5-10 minutes.\nIn a food processor, add the chipotle, cilantro, garlic clove, olive oil, lime juice, zest of lime, and a few cranks of black pepper. Pulse until well combined.\nTaste it. Add salt as needed. Spoon over carne asada.\n\nFlour Tortillas (adapted from Diana Kennedy)\n\n450 g bread flour\n80 g lard (or butter / vegetable oil)*\n5 g coarse kosher salt\n250 ml warm water\n\nMethod\n\nAdd the flour to a bowl and rub in the lard (or butter) using your finger tips until broken up.\nDissolve the salt in the warm water. Gradually add the water and mix it into the flour mixture to see how much it will absorb.\nTurn the dough onto a flat surface and work into a cohesive dough with your hands for about 5 minutes. At the end, the dough should be fairly smooth and not sticking to your hands. Cover with plastic wrap and let rest for at least 20 minutes or up to 2 hours.\nDivide the dough into 9 pieces (for a medium burrito size) by weighing them out on a scale (about 80 g). Roll them into very smooth small balls with your hands.\n\n\nNote: The dough balls can be stored in your fridge for 3-4 days for on demand fresh tortillas.\n\n\nHeat a large griddle or cast iron pan over medium heat.\nFlatten the tortilla ball and roll out to your desired thinness.\nLay the tortilla on the hot griddle and cook for 10-20 seconds, then flip to the other side to cook for another 10-20 seconds. The tortillas should be lightly browned in spots. Be careful not to overcook the tortilla or else they will become hard instead of soft and pliable.\nImmediately, stack the tortillas in a large cloth or clean kitchen towel until you are ready for serving.\n\nNote: Diana’s original recipe calls for 115 g. I made it with that amount the first time around before lowering the amount of fat. The tortillas are just as good texture and flavor wise while saving calories so that’s why I lowered it.\n", "Hey everyone! Here's a really good cheesecake recipe. It's got coffee cheesecake filling and vanilla sponge as the base. If you'd like to see more gifs of it including a video of me cutting into it, feel free to check it out on my blog: https://www.thesulkychef.com/home/tasty-and-moist-brooklyn-style-cheesecake\nServings: 12\nEquipment: Blender, spring form pan, rubber spatula, pallet knife, whisk.\nPrep Time: 1.5 hours\nCook Time: 3 hours\nChill Time: 9 hours\nTotal Time: 13.5 hours\nIngredients for Coffee Cheese Filling:\n2 250g bricks Cream Cheese, very soft.\n250g or 1 cup Yogurt\n60mL or 1/4 cup Whole Milk\n5 tbsp Evaporated Milk or Heavy Cream\n2 Whole Eggs\n135g or 2/3 cup Sugar\n2 tsp Instant Coffee Powder, sifted\n75g or 1/4 cup Condensed Milk\n2 tsp Vanilla Extract or Paste\nBoiling water for water bath\nIngredients for Vanilla Sponge\n120g or 1/2 cup Unsalted Butter\n200g or 1 cup Sugar\n4 Whole Eggs\n4 tbsp Milk Powder or Evaporated Milk\n6 oz White Chocolate\n125g or 1 cup All Purpose Flour\n1/2 tsp Baking Powder\n1/2 tsp Salt\nCake Preparation\nPreheat oven to 350F/175C.\nGrease the sides of a round 9-inch Spring form pan with butter.\nMelt chocolate and butter together.\nTake off heat and mix in sugar and milk powder/evaporated milk.\nAdd eggs one at a time and fold together.\nSift in baking powder, salt, and flour, mix together well. \nPour into pan and bake for about 40-45 minutes or until skewer inserted comes out clean.\nThe top of the cake will dome and turn a nice golden brown color.\nLet the cake cool and then trim the top to flatten it. \nCoffee Cheesecake Filling Prep\nCool oven to 320F/160C. Bring a kettle of water to a boil, this is for the water bath.\nWrap the bottom of the cake pan with foil, it’s best if you wrap it multiple times to ensure a nice waterproof seal.\nSoften cream cheese by microwaving for 45 seconds and then place in blender.\nBlend cheese, yogurt, and all the milks together(condensed, whole, and evaporated/cream) until smooth.\nAdd in eggs, sugar, vanilla, and coffee then blend together well. Make sure you scrape down the blender sides to ensure no lumps are present.\nPour cheesecake filling onto vanilla sponge and place pan in water bath. You want to pour enough water around the pan that it covers half of it. Bake for 1 hour and 20 minutes then turn off the oven and bake for an additional 45 minutes. The center will be a little jiggly, that’s okay. \nRemove from oven and run a pallet knife around the edge to release cake from the pan. \nLet it cool for 1 hour on the counter before chilling in the fridge for at least 6 hours. Overnight is ideal but 6-7 hours will work in a pinch. \nBefore cutting,  run a knife under hot water and then wipe it dry. This will help you to get a nice clean cut.\nServe with fruits or a dollop of whipped cream up top.\n", "Recipe from Prego series 2 Pizzelle Baker\nItalian Pizzelles\n3 eggs\n1/2 teaspoon anise seed or extract (optional)\n2 teaspoons baking powder\n1 teaspoon vanilla extract \n1 3/4 cups flour (all purpose)\n1/2 cup butter, melted (1/4 lb)\n3/4 cup sugar\nBeat eggs and sugar. \nAdd cooled melted butter, and vanilla and anise (I used lemon zest). \nSift flour and baking powder and add to egg mixture. \nBatter will be stiff enough to be dropped by spoon. \nMakes 30 Pizzelles.\n", "Please watch my `making of` video here.\nIngredients\nNote: Everywhere you see vinegar - preferably apple cider or rice vinegar, as those don't have as harsh of a flavor as regular vinegar\nBroth\n\n3 pounds pig feet - or any bones and skin from large animals (pork, etc)\nbunch of green onion\n2 yellow onions\n1 garlic bulb\n6 inch knob ginger\n1 red onion water\n\nTare\n\n1 cup soy sauce\n1 tsp anchovies paste / fillet\n2 roasted garlic bulbs\n1/2 cup mirin or mirin substitute\n\nChashu pork\n\n3-4 pound pork belly (preferably skin on)\n3/4 cup soy sauce\n3/4 cup mirin\n1/2 cup water\n1/2 cup vinegar\n6 inch knob ginger\nbunch green onion\n6 garlic cloves\n\nRamen egg\n\n4 soft boil eggs\n1/4 cup soy sauce\n1/8 cup vinegar\n1/4 cup water\n1/4 cup mirin\n\nMirin substitute\n\n4 tablespoons dry white wine\n2 tablespoons honey\n2/3 tablespoon vinegar\n\nDirections:\n\nBlanch pig feet.\nBoil pig feet for 12 hours, after adding the veggies\nAfter tightly tying the pork belly, bake it in the oven with all the veggies and the sauce.\nTo make the tare, mix all the ingredients mentioned above\nTo make the ramen egg, marinate it for at least 6 hours.\n\n", "I doubled the recipe and used two cans of corn, instead of grilled corn.\n2 cans Trader Joe’s corn \n1 tablespoon butter\n2 tablespoons vegan mayo\nSalt and pepper to taste\nChili powder to taste\n2 tablespoons sriracha\n1 jalapeño chopped fine with seeds\n1/2 red onion chopped fine \n1 huge bunch cilantro (I love cilantro)\n1/2 lemon juice\n1 whole lime\n1/4 cup crumbled feta cheese\nPut it in the refrigerator so all the flavors can meld together, and will eat it in a few hours!\nThanks u/glamyogini!\n", "Recipe here originally: Steak and Rice Noodle Bowl\nSteak and Rice Noodle Bowl\nThis steak and rice noodle bowl is a combination of sweet Summer tomatoes, spicy red Fresno peppers, and sweet basil for a perfect combination of sweetly acidic and spicy flavors.0\nPrep Time: 15 minutes\nCook Time: 30 minutes\nTotal Time: 45 minutes \nServings: 2 \nCalories: 560kcal\nEquipment\n\nLarge pot\nWide skillet\nSkillet\n\nIngredients\n\n12 ounces wide rice noodles\n2 teaspoons sesame oil\n2 teaspoons neutral cooking oil\n1 small yellow onion peeled and diced\n5 cloves garlic peeled and minced\n2 red Fresno chili peppers trimmed and sliced\n3 large heirloom tomatoes (about 1¼ pounds) trimmed and thinly sliced\n2 sprigs basil plus more for garnish\n1/4 cup chicken stock plus more, if needed\n2 teaspoons neutral cooking oil\n2 teaspoons butter\n¾ pound ribeye steak\nSalt and pepper to taste\n\nFor Garnish:\n\nChili oil\nSesame oil\nSesame seeds\n\nInstructions\nPrepare the Rice Noodles:\n\nPrepare the rice noodles according to package instructions. Drain, rinse, and drizzle with sesame oil and a sprinkle of salt. Set aside.\n\nStart the Sauce:\n\nHeat the neutral cooking oil in a wide skillet over medium heat. Add the onion and cook for 4-5 minutes until it begins to soften. Add the garlic and red Fresno peppers and cook for 1-2 minutes until fragrant.\nArrange the sliced tomatoes in the skillet and cook for 4-6 minutes until they begin to char and soften; be careful not to burn the onions. Season with salt and pepper.\nAdd the basil leaves and chicken stock and gently turn the tomatoes. Carefully mash some of the tomatoes into the sauce and leave some of the tomatoes whole. Reduce heat to low and simmer for 10-15 minutes, adding more chicken stock if necessary.\n\nCook the Steak:\n\nAs the sauce simmers, cook the steak. Pat the ribeye dry and season all over with salt and pepper. Heat 2 teaspoons neutral cooking oil in a skillet over high heat. Add the steak and cook for 3-5 minutes per side, depending on thickness. About 1 minute before removing the steak, add the butter into the skillet and tilt the skillet toward you. Baste the steak with the butter as it finishes searing. Turn off the heat.\nTransfer the steak to a cutting board to rest for 5-7 minutes before slicing thinly.\n\nSauce the Noodles:\n\nTransfer the cooked rice noodles to the skillet with the sauce and toss gently to combine. Taste and season again with salt and pepper.\n\nTo Serve:\n\nDivide the noodles between bowls and arrange the sliced steak on top. Garnish with a few basil leaves, a drizzle of chili oil, and a drizzle of sesame oil. Sprinkle with sesame seeds. Enjoy!\n\nNutrition\nCalories: 560kcal | Carbohydrates: 11g | Protein: 37g | Fat: 42g | Saturated Fat: 15g | Cholesterol: 115mg | Sodium: 178mg | Potassium: 955mg | Fiber: 2g | Sugar: 5g | Vitamin A: 1793IU | Vitamin C: 28mg | Calcium: 44mg | Iron: 4mg\n", "They're so cute (❤️o❤️). I would kill for a pineapple tart\n", "Strawberry Souffle Recipe:\nvideo instruction:\nhttps://youtu.be/jCxuDpUSpmc\nIngredients:\n120g strawberries \n35g sugar \n1tsp lemon juice \n1 tbsp corn starch \n2 egg white (medium size) \na pinch of salt\n30g sugar powdered sugar for decoration\nInstruction:\n\nStrawberry base\n\nBlend chopped strawberries with sugar and lemon juice\nStrain the puree using a sieve\nPut it on medium heat and stir in corn starch\nRemove from heat when it becomes thicken and let it cool down\n\nThe meringue\n\nWhisk 2 room temperature egg white with a pinch of salt\nWhen it's foamy, start to add total 30g sugar in several times\nWhisk to soft peaks then fold to combine with the strawberry base\nBake at 180C for 12 minutes\nServe right away\n", "edited: \nDid you know that the tradition wants that a charm (fêve) is hidden in the cake (galette) and the one that finds it assigns her king or his queen for the day and kisses!\nIf you’d like to learn a little more about the tradition and a little french in process check out my fiancé and I in this:\n🎥 youtube tutorial video\nIngredients:\n* 6 tablespoons (85 grams) unsalted butter, at room temperature\n* ½ cup (60 grams) powdered sugar\n* ¾ cup (85 grams) almond flour\n* ¼ teaspoon salt\n* 2 large eggs, at room temperature\n* Zest of 1 meyer lemon\n* 1 tsp pure almond extract\n* 1 tsp pure vanilla extract\n* 1 tablespoon rum (optional)\n* 2 frozen puff pastry sheets (14- to 17-ounce package; 396-482 grams), cut into two 9 in circles, cold \n* 1 feve (if you dont have a small charm, you can use a whole almond or dried bean instead)  \nDirections:\nTo make the filling\nCream the butter and sugar together until light and fluffy. Beat in the almond flour and the salt. Mix in 1 whole egg, then the white from the second egg (reserve the yolk). Mix in the rum, if using, and the vanilla and almond extracts. Spoon into a piping bag or just cover, and refrigerate for at least 1 hour. \nMix the yolk with 1 teaspoon cold water; cover, and refrigerate until needed.   \nTo assemble:\nPlace one circle of dough on a baking sheet lined with parchment paper. Pipe or spread the filling evenly over the dough, leaving a 1-inch border bare. Press the charm into the filling. Moisten the border with cold water, position the second circle of dough over the filling and press around the border with your fingertips or the rim of a bowl to seal well. Using the back of a table knife, scallop the edges by pushing into the dough (about 1/4- to 1/2-inch deep) every 1/2 inch or so. Refrigerate for at least 30 minutes.  \nHeat the oven to 425 F. Brush a thin layer of the reserved yolk glaze over the top of the galette, avoiding the border. With the point of a knife, etch a design into the top of the galette, taking care not to pierce the dough. Cut 6 small slits in the top as steam vents.  \nTurn the heat down to 400 F, and bake for 30 to 40 minutes, until the galette is puffed and deeply golden. Check after 20 minutes, and tent loosely with foil if it’s browning too much or too fast. Transfer to a rack, and cool for at least 15 minutes. Serve warm or at room temperature.\n", "I have resisted traditional shakshuka because tomatoes in that concentration are bit too acidic for me. This looks perfect—love leeks and artichoke hearts, especially. Going to make this this weekend. Thank you for sharing!\n", "Recipe from Delish\nhttps://www.delish.com/cooking/recipe-ideas/a28848483/brioche-bread-recipe/\n", "Link to recipe.\nIngredients\n\n4 cups white peaches, sliced\n2 tablespoons lemon juice\n2 tablespoons rose water\n1 cup sugar\n½ cup water\n2 tablespoons lemon juice\nrose petals for garnish\n\nInstructions\n\nIn a medium pot, combine the peaches, lemon juice, rose water, sugar and water to a simmer. Cook for about 5 minutes, stirring often, until the sugar has dissolved and the peaches are soft.\nLet the mixture cool for about 15 minutes, then pour the contents into the jar of a blender. Puree on high until the mixture is very smooth. Add extra 2 tablespoons of lemon juice and quickly blend for a few more seconds.\nPour the sorbet mixture into an ice cream maker and churn according to directions or just pour it into a metal loaf pan and put in the freezer. Either way, the sorbet should be in the freezer at least 6 to 8 hours.\nScoop and serve.\n\nPreparation time: 10 minute(s)\nCooking time: 5 minute(s)\nNumber of servings (yield): 8\n", "Yesterday was Canada Day, and these were the cookies I made to celebrate! Even if you don't celebrate it, these are simple and tasty treat to make! 🇨🇦\nLink to recipe: https://www.sarahfreia.com/blog/gluten-free-canadian-maple-syrup-cookies-recipe\nIngredients\n\n2 1/4 cups (305g) flour\n\n\nIf using Gluten Free flour, add 1/2 tsp xanthan gum\n\n1/2 cup (48g) almond flour\n1/2 cups (100g) brown sugar\n1/2 cup (115g) granulated sugar\n1 tsp baking soda\n1 egg\n1/2 cup (113g) salted butter\n3/4 cup (255g) maple syrup\n1 tsp vanilla extract\n1/2 tsp salt\n\nDirections\n\nIn one bowl, add 1/2 cup (100g) brown sugar, 1/2 cup (115g) granulated sugar, 1 tsp vanilla extract, 1/2 cup (113g) butter, 3/4 cup (255g) maple syrup (these are the wet ingredients)\nWith a whisk or a handheld mixer, mix all of the ingredients together until well blended\nAdd 1 egg, and mix again\nIn a separate bowl, add 2 1/4 cups (305g) flour, 1/2 (48g) almond flour, 1 tsp baking soda, and 1/2 tsp salt (these are the dry ingredients)\nMix all of the dry ingredients together\nSlowly pour 1/4 portions of the dry ingredients into the wet ingredients, until fully combined\nGently stir all of the ingredients together until just blended\nTake out golf ball sized portions of dough, and roll them together between your palms\nLine a baking pan with either parchment paper - OR - cooking spray\nPlace dollar-sized balls of dough on the pan\nBake the biscuits in the oven at 350°F (180°C) for 9-10 minutes\nAllow the biscuits to cool for a minimum of 15 minutes\nIf desired, top the cookies with an Maple Syrup Glaze for that extra oomph\nEnjoy!\n\n", "My hash browns recipe is both crispy and buttery, resulting in breakfast heaven for anyone who loves potatoes. Whether you like your hash browns as patties or shredded, I’ve got you covered!\nRecipe at: https://maplewoodroad.com/food/how-to-make-hash-browns/\nFull recipe and A LOT MORE detailed instructions and info at link above.\nIngredients\n\n1 c potatoes, shredded\n1-1/2 Tbsp butter\nSalt and pepper\n\nInstructions\n\nPlace shredded potatoes in a bowl and fill with cool water, then immediately drain. Repeat this process about four times, until water runs clear.\nPlace potatoes in a mesh sieve, just to drain off excess water, then place potatoes on a clean kitchen towel.\nBy twisting and squeezing the towel, squeeze out as much water from the potatoes as possible; repeat several times.\nHeat 1-1/2 Tbsp of butter in a pan over low heat.\nAdd 1 c of shredded potatoes to pan and season with salt and pepper to taste.\nPress down lightly on top of potatoes with a spatula, just to flatten it slightly. Then don't touch it.\nAfter 5 to 6 minutes, when the bottom has firmed up, sticks together, and is lightly browned, flip it over and cook for another 4 minutes.\n\nVariation: Loose Shredded Hash Browns\n\nFollow same steps as above, but instead of pressing the shredded potatoes into a patty, stir them around every minute or so, lightly browning all sides, making sure to keep everything in one thin layer. This technique will take about 6 minutes.\n\n", "https://www.onehealthypickle.com/2021/01/black-bean-veggie-dip.html?fbclid=IwAR0aessam4-dHWvG4drf7Sb3IuMG8SkxhLfRc0FgJZEsn2HhPJKeU1fDIUY&m=1\nIngredients:\n1 can corn\n1 can black beans rinsed\n2 bell peppers (I prefer red) diced\n2 avocados diced\n1 bunch cilantro (go organic, it tastes remarkably better) chopped\n1 shallot minced\n1 lime (I substituted a lemon)\n1-2 tbsp. olive oil\nsalt and pepper to taste\noptional: jalapeno, garlic, spices\nDirections:\n1) Rinse corn and beans, place in mixing bowl.\n2) Prepare peppers, cilantro, shallots, and any optional ingredients and mix with corn and beans.\n3) Dice avocados and add to the mixing bowl.  Then squeeze the lime and olive oil over the avocados and mix (this helps to preserve them).\n", "Yo I'm adding this to my \"things I wanna make but never will\" folder\n", "\"2 shots of vodka.....\"\n", "This is also lnown as Chili sin Carne.\n", "Detailed video recipe\nHere is the recipe :\nBrownie batter \n\n75 g all purpose flour, 2/3 cup\n60 g sugar, 1/2 cup \n70 g butter, 1/3 cup\n2 eggs\n125 g milk chocolate , 3/4 cup \nA pinch of salt\n\nCookie dough\n\n85 g all purpose flour,  3/4 cup\n50 g brown sugar, 1/3 cup \n60 g melted butter, 1/3 cup \n1/2 egg \n1 tsp baking powder\n75 g chocolate chips, 2/3 cup\n\nInstructions\nBrownie batter \n\nStart by melting the butter and chocolate together.\nWhisk togethet the eggs and sugar.\nAdd in the melted chocolate and butter.\nAdd the flour and salt and mix until incorporated.\nPour the batter in a mould and set aside while making the cookie dough.\n\nCookie dough\n\nWhisk together the sugar and melted butter .\nAdd the egg and whisk. Add the vanilla extract and mix.\nAdd in the flour and baking powder, then mix.\nAdd the chocolate chips and mix.\n\nAssembly & baking\n\nCover the brownie battr with cookie dough.\nPreheat the oven at 180°C (350 F) and bake for 35 min.\nLet cool at room temperature for at least an hour before serving.\n\n", "Matcha Mousse Cake\n1. the cake\nmix 2 egg yolks with 10g sugar\nadd 35g milk, 20g melted butter\nsift in 45g cake flour and 4g matcha powder\nbeat 2 egg white with 40g sugar + pinch of salt + a little bit lemon juice\nFold egg yolk mixture into egg white mixture\nBake 180C in 20 minutes. Once done let it cool down completely. Use 8cm mold to cut the cake in two circles.\n2. the white mousse\nmelt 50g white chocolate\nadd 80g warm milk and 3 gelatine sheets\nwhisk 130g heavy cream\nmix the chocolate mixture with the whipped cream\nArrange the cake: One layer cake, one layer of white mouse then another layer of cake. Chill in the fridge in 20 minutes.\n3. Matcha mousse\n40g warm milk + 3g matcha\npour the matcha mixture into the white mousse\nInstruction video\n", "Video recipe! \nRECIPE\n(I believe it yielded ~350g of a marshmallow slab.)\nIngredients\n100g egg yolks (~5-6 eggs)\n2g salt\n14g gelatin + 85g cold water (filtered, preferably)\n180g sugar\n60g water\n~10g/2tsp vanilla extract of your preference\nDirections\nBloom the gelatin in the cold water for 5-10 minutes. Add sugar and the other water quantity to a saucepan and heat on medium. Meanwhile, beat egg yolks and salt in the bowl of a stand mixer on low speed with a whisk attachment.\nHeat sugar syrup to 240F/115.5C, turn mixer speed to high, and drizzle syrup into the side of the mixer bowl. Beat on high for several minutes, until mixture is cooled significantly and has increased in volume and is pale in color. In the same saucepan, gently melt bloomed gelatin, and add to the mixture, in addition to the vanilla. Beat for five minutes, then spread mixture into a greased loaf pan. Allow to dry for 8 hours minimum (preferably...16, I think). \nDust a cutting board with an equal mixture of corn starch and powdered sugar (25g each should be sufficient). Unmold marshmallow slab, dust the top, and cut into cubes. Toss cubes in remaining sugar/cornstarch mix.\n", "INGREDIENTS\nCake\n* 1 cup freshly brewed hot coffee\n\n1/2 cup Unsweetened natural cocoa powder\n3/4 cup packed light brown sugar\n1/2 cup full fat sour cream \n2 teaspoons vanilla extract\n8 tablespoons (1 stick) unsalted butter, at room temperature\n1 1/4 cups granulated sugar\n2 eggs\n1 1/4 cups all-purpose flour\n3/4 teaspoon baking soda\n1 teaspoon table salt\n\nChocolate Ganache\n* 8 ounces of semi sweet chocolate chips \n\nHalf cup of heavy cream \n\nPREPARATION\n1. Preheat the oven to 350°F. Prepare a 10-inch round cake pan by greasing it with cooking spray and then lining the bottom with parchment paper.\n2. To make cake, pour the hot coffee into a medium bowl and stir in the cocoa powder until it dissolves. Stir in the brown sugar, followed by the sour cream and the vanilla. Stir thoroughly.\n3. Using a mixer, beat the butter and granulated sugar on medium speed until light-yellow and fluffy,Add the eggs and mix for 2 minutes.\n4. In a medium bowl, whisk together the flour, baking soda, and salt. On low speed, mix in a third of the flour mixture and half of the coffee mixture. Add another third of the flour mixture and all the remaining coffee mixture. Using a rubber spatula, fold in the remaining flour mixture until all of the ingredients are fully incorporated. Pour the batter into the prepared cake pan.\n5. Bake for 25 minutes. Rotate the pan in the oven and bake for 25 more minutes. Remove from oven and let cook for at least 20 mins. Then turn the cake out onto a clean plate, remove the parchment, and turn the cake back over onto a wire rack. Let the cake cool completely.\n6. Place the  chocolate chips into a bowl and set aside.\n7.Heat the heavy cream in a quart-sized,\nmicrowavable container and microwave for 3 to 4 minutes on high, or heat on stovetop medium heat until it just begins to simmer. Pour the cream over the chocolate chocolate chips and let stand for 2 minutes. Mix until smooth and pour over cooled cake. Let ganache set for at least 15 mins. Slice and serve!\nIf you’d like to watch me make this cake, you can check it out here!\n", "Recipe here originally: Fettuccine with Sausage and Leeks\nThis is the very first meal I prepared in our new home! It's so delicious and easy to make.\nPrep Time: 15 minutes\nCook Time: 40 minutes\nTotal Time: 55 minutes\nServings: 5\nCalories: 782kcal\nEquipment\n\nLarge pot\nWide skillet\n\nIngredients\n\n16 ounces fettuccine\n2 teaspoons neutral frying oil\n1 pound hot Italian sausage loose\n1 shallot peeled and sliced\n1 leek trimmed, washed, and sliced into half-moons\n10 ounces cremini mushrooms trimmed, scrubbed, and thinly sliced\n4 cloves garlic peeled and minced\n2 tablespoons butter\n1/2 cup white wine or chicken stock\n1/2 cup chicken stock\n15 ounce can fire-roasted tomatoes\n1/2 teaspoon crushed red pepper more or less to taste\nSalt and pepper to taste\n1/4 cup fresh parsley minced\n\nInstructionsStart the Pasta:\n\nBring a large pot of salted water to a boil. Cook the fettuccine until al dente. Remove 3/4 cup of the pasta cooking water from the pot. Drain the pasta and set aside. \\Note, if you time it right, the pasta should be done as the sauce finishes simmering. If possible, simply using a spider strainer to transfer the cooked pasta directly to the sauce.*\n\nStart the Sauce:\n\nHeat the oil in the skillet over medium heat. Add the sausage and cook, breaking up with a wooden spoon, for 10-13 minutes until mostly cooked through and beginning to crisp up around the edges.\nAdd the sliced shallot and cook for 3-4 minutes until it begins to soften. After the shallot softens, add the sliced leeks and cook an additional 5-6 minutes until it softens.\nAdd the mushrooms and cook for 8-10 minutes, stirring occasionally, until the mushrooms soften and begin to brown. Taste and season with salt, pepper, and crushed red pepper.\n\nSimmer the Sauce:\n\nMelt the butter into the skillet. Once it is melted and frothy, add the white wine, and bring to a boil. Reduce heat and add the chicken stock and tomatoes. Simmer for 30 minutes, adding more liquid (water or stock) as necessary if the sauce becomes too thick or sticks to the skillet.\n\nSauce the Pasta:\n\nTransfer the cooked fettuccine and the minced parsley to the skillet along with the reserved pasta cooking water and toss to coat until the pasta is glossy and well-coated.\n\nNutrition\nCalories: 782kcal | Carbohydrates: 78g | Protein: 29g | Fat: 37g | Saturated Fat: 14g | Cholesterol: 158mg | Sodium: 902mg | Potassium: 822mg | Fiber: 5g | Sugar: 6g | Vitamin A: 1145IU | Vitamin C: 11mg | Calcium: 105mg | Iron: 4mg\n", "INGREDIENTS: (2 servings)\n\n4 large prawns (whole)\n150g squid (cleaned)\n2 stalks of lemongrass\n1 knob of galangal (blue ginger)\n6-7 Kaffir lime leaves\n3-4 Thai chilies\n1 medium shallot\n1 medium tomato\n5-6 large oyster mushrooms\n1 litre of water\n\nSEASONINGS:\n\n2.5 tbs Thai red chili paste\n1.5 tbs sugar, 6-7 tbs fresh lime juice\n3 tbs fish sauce\n40ml evaporated milk \nAdjust the ratio accordingly, due to the different level of saltiness and sweetness of the chili paste & fish sauce\n\nNOTE:\n\nIf you are lactose intolerant and still would like to have a little bit of creaminess in the soup, you can use coconut milk or other plant milk. However, they will impart some different flavours in this soup. Or, you can just skip the milk!\nThe herbs are used to add flavours in the soup. Don't eat them as they are very fibrous! \n\nSTEPS:\n\nRemove heads and shells of the prawn, then devein them.\nCut squid into bite sized pieces\nOptional: to make them look nicer, make shallow crisscross cuts on the inside of the squid pieces.\nIn a pot, add 1tbs of oil, fry the heads and shells, press them using a potato smasher to further extract the juice from the heads.\nAdd 1 litre of water and let simmer on low heat for 25 minutes\nUse the back of the knife to bruise lemongrass stalks, then slice them diagonally\nSlice galangal/blue ginger into thick slices\nSlightly break up/tear the kaffir lime leaves\nBruise chili and cut them into halves\nSlice shallot into small wedges\nSlice tomato into chunks\nBreak oyster mushrooms into medium pieces\nAfter 25 minutes, remove prawn’s heads and shells\nAdd lemongrass, galangal, chili and kaffir lime leaves. Simmer for 5 mins\nAdd fish sauce, sugar, and Thai red chili paste. Stir well to dissolve\nAdd shallot, tomato, mushrooms. Stir well\nAdd squid, stir and when it is almost cooked, add prawns\nAdd milk, make sure to use low heat. When everything is cooked, taste and check the level of saltiness and sweetness. Remove from heat.\nKeep stirring gently to slightly bring down the temperature of the soup, then add lime juice and mix well. Always add lime juice last, otherwise it will turn bitter if cooked.\nServe hot, garnish with cilantro. It can be eaten on its own, or with steamed Jasmine rice. Enjoy!\n\nHere is step by step guide if you are interested\n", "Step by step video recipe\nHere is the full recipe.\nMaterial\n\nPie ring or mould of 16cm \nPiping bag and a nozzle (star)\n\nIngredients\nPie dough\n\n200 g flour\n1 whole egg\n100 g butter (at room temperature)\n80 g icing sugar\n\nSalted butter caramel \n\n185 g heavy cream\n80 g salted butter \n160 g sugar\n\nItalian meringue\n\n200 g sugar \n50 g water\n75 g egg white\n\nTwo medium bananas for assembling\nDirections\nMaking the pie dough\n\nMicrowave the butter for 20 s on medium heat untill soft but not melted. Mix with a spatula or whisk. Add the sugar and mix until completely incorporated.\nAdd the beaten whole egg and mix with a spatula or maryse.\nPour the flour on the bench. Make a well in the middle and add the egg, butter and sugar mixture. Knead by hand until the flour is incorporated.\nWrap the dough in plastic paper and refrigerate for 1 hour.\nTake the dough out of the fridge and roll it out onto a floured work surface.\nInsert the dough in a pie mold or pie pan, and prick with a fork for even baking. Set to cool for 30 min.\nPreheat the oven to 180 ° and bake for about 20 min.\nOnce the dough is cooked, allow to cool before going on to assembling.\n\nSalted caramel\n\nCut the salted butter into small squares.\nIn a saucepan over low heat, add about three tablespoons of sugar.\nWait until the sugar starts to melt and start adding it little by little.\nMeanwhile, put the cream to heat in a saucepan.\nOnce the sugar is completely caramelized, add the hot cream little by little while mixing. Be careful, this is a dangerous step because there may be projection of hot caramel.\nAdd the butter squares and mix until completely incorporated.\nPour into a bowl or baking pan and let cool to room temperature.\n\nItalian meringue\n\nMix sugar and water and bring to a boil until the temperature reaches 108 ° C.\nIn the mean time, whip the remaining 73g of egg whites, using an electric mixer. Pour the hot syrup (sugar and water) over the whipped egg whites making sure it is poured on the side of the bowl.\nTurn the mixer  at low speed until the syrup is completely incorporated.\nThen whip at high speed until the meringue has cooled.\n\nAssembling the pie\n\nPlace the sweet dough on a presentation dish. Garnish completely with caramel until reaching the edges.\nCut the two bananas into small round pieces. Cover the caramel layer with the banana pieces.\nPut the meringue in a piping bag with the desired nozzle. Decorate with the pie with meringue.\nLet set in the fridge for 1 hour before serving.\n\n", "Your search for the perfect wonton recipe is OVER. Filling, wrapping, cooking and even a bonus recipe to make Sichuan Spicy Wontons. Enjoy~Check out my recipe video and channel! -> https://youtu.be/vqVxvHGv7pc(Consider subscribing if you enjoy :D got lots of good recipes)\nRecipe (10 servings: 50-100 wontons)\n\nGinger (3 slices)\nScallion (1 large)\nChinese Celery (5 small stalks)\nYellow Chives (large bunch)\nShrimp (1 pound)\nGround Pork Fat (1/4 pound)\nSalt, White Pepper, Chicken Stock (1/2tsp)\nSesame oil (a touch)\nEgg (1)\nCorn starch (1 tsp)\nWonton Wrappers (50-100)\n\n\nPrep the ingredients: finely mince the ginger and scallions, roughly mince the celery and rough dice the yellow chives. Clean the shrimp by cutting the top half and washing in a sink, then smash them and roughly dice.\nThrow shrimp into a mixing bowl and add one egg white along with the ginger/scallions. Using a claw shape, mix this until sticky. Add the pork fat and continue to mix until paste-like and sticky. Pick up the mixture and throw it into the bowl, this will tenderize the meat very well.\nAdd in the chives/celery and also some sesame oil and corn starch. At this point mix very gently to prevent damaging any of the vegetables, transfer to a smaller bowl for wrapping.\nWrap the wontons using a small butter knife, and egg yolk as a glue.(I wish I could post short videos on here so I could show you the actual technique on how to wrap them up. But I have a very good guide on my youtube video, so check it out if you need visual representation :)\nYou can steam or boil the wontons for 6-9 minutes. Steaming will give you a more tender consistency but is optional.... and DONE!\n\nSichuan Spicy Sauce (2 servings, use more as needed)\n\nGarlic (2 cloves)\nGinger (3 slices)\nScallions (1 large)\nBao Bei Chili Oil (4 tbl)\nSoy paste (1.5 tbl)\nSugar (1/2 tsp)\n\n\nMince everything very well and add in sauces.. mix. Drizzle as much as you want on top of freshly cooked wontons and garnish with scallions.\n\n"]